[
  {
    "_id": "6737e70f53f6ff0e79aa3af1",
    "name": "CSYE",
    "number": "6200",
    "subjectName": "Concepts of Object-Oriented Design",
    "credits": "4",
    "description": "Introduces object-oriented design and programming via the Java programming language; the use of inheritance, composition, and interface classes in software design; development of Java applets and applications; study of the Java class libraries, including the swing tool kit for building human computer interfaces, the network package for development of client-server systems, and the collections’ package for data structures and sorting algorithms. Requires a course project. Requires knowledge of C programming.",
    "prerequisites": "None",
    "corequisites": "None",
    "rank": 85,
    "pickReason": "The course CSYE 6200 - Concepts of Object-Oriented Design shows high relevance to the candidate's profile for several reasons:\n\n1. Skills Alignment (30/30):\n- The candidate has extensive Java experience as evident from their work at LSEG and Citrix using Spring Boot\n- The course's focus on Java programming directly aligns with their current skill set\n- Object-oriented concepts are fundamental to their current tech stack (Spring Boot, Micronaut)\n\n2. Career Goals Alignment (25/30):\n- Given their software engineering background and current role, advanced OOP concepts are crucial\n- The course's coverage of GUI development (swing toolkit) and client-server systems aligns with their full-stack development experience\n- Network package study complements their cloud & DevOps expertise\n\n3. Learning Gaps (15/20):\n- While the candidate has Java experience, formal OOP concepts could strengthen their architectural understanding\n- The course's focus on design patterns and software design principles would enhance their system design capabilities\n\n4. Industry/Domain Relevance (15/20):\n- The course content is highly relevant to their work in enterprise software development\n- The project component aligns with their hands-on development experience\n\nTotal Score: 85/100\n\nWhile the course is highly relevant, it's rated at 85 instead of higher because:\n1. The candidate already has significant Java experience\n2. Some basic concepts might be redundant given their professional experience\n3. The course might be more beneficial if taken earlier in their career",
    "hasPreReq": false,
    "hasCoreReq": false
  },
  {
    "_id": "6737e71053f6ff0e79aa3af2",
    "name": "CSYE",
    "number": "6202",
    "subjectName": "Concepts of Object-Oriented Design with C#",
    "credits": "4",
    "description": "Introduces object-oriented design and programming via the C# (C-sharp) programming language and its underlying .NET platform. Covers the use of inheritance and composition in software design and development of complex C# .NET applications. Topics include classes, overloading, data abstraction, information hiding, encapsulation, inheritance, polymorphism, file processing, templates, exceptions, container classes, and low-level language features.",
    "prerequisites": "None",
    "corequisites": "None",
    "rank": 65,
    "pickReason": "The course 'CSYE 6202 - Concepts of Object-Oriented Design with C#' shows moderate relevance to the candidate's profile based on the following analysis:\n\nStrengths (What makes it relevant):\n1. The candidate has strong programming experience with similar object-oriented languages like Java and Python\n2. Their work experience at LSEG and Allstate involves complex software development, where OOP principles are fundamental\n3. The course's focus on software design aligns with their Master's in Software Engineering Systems\n\nLimitations (Why not higher ranking):\n1. C# and .NET are not currently listed in their skill set, suggesting they may have already chosen different technology stacks\n2. Their current work primarily focuses on web technologies (ReactJS, NodeJS) and cloud platforms (AWS, GCP)\n3. Their projects and experience show more emphasis on modern web development, cloud architecture, and AI integration rather than traditional OOP\n\nGap Analysis:\n1. While the course could provide valuable OOP fundamentals, it may not directly advance their current career trajectory\n2. The candidate's resume suggests they're already working at an advanced level with modern frameworks and cloud technologies\n\nConclusion:\nWhile the course offers solid foundational knowledge in OOP and C#, the moderate ranking (65) reflects that while valuable, it may not be the most strategic choice given their current skill set and career direction in web development and cloud technologies.",
    "hasPreReq": false,
    "hasCoreReq": false
  },
  {
    "_id": "6737e71053f6ff0e79aa3af3",
    "name": "CSYE",
    "number": "6205",
    "subjectName": "Concepts of Object-Oriented Design with C++",
    "credits": "4",
    "description": "Introduces object-oriented design and programming via the C++ programming language. Covers the use of inheritance and composition in software design and development of complex C++ applications. Topics include classes, overloading, data abstraction, information hiding, encapsulation, inheritance, polymorphism, file processing, templates, exceptions, container classes, and low-level language features. Requires a course project.",
    "prerequisites": "None",
    "corequisites": "None",
    "rank": 45,
    "pickReason": "The course CSYE 6205 - Concepts of Object-Oriented Design with C++ receives a moderate-to-low relevance score of 45 based on the following analysis:\n\nSkills Alignment (Score: 12/30):\n- The resume shows no direct C++ experience\n- The candidate's primary programming languages are Python, Java, JavaScript, and TypeScript\n- While OOP concepts are valuable, the specific focus on C++ may not directly enhance current tech stack\n\nCareer Goals Alignment (Score: 15/30):\n- Based on work experience at LSEG, Allstate, and Citrix, the focus has been on web development, cloud solutions, and enterprise applications\n- The candidate's trajectory appears more aligned with full-stack development and cloud technologies\n- C++ might be tangentially useful but not central to current career direction\n\nLearning Gaps (Score: 10/20):\n- While learning C++ could provide low-level programming knowledge\n- The resume suggests gaps in cloud and web technologies would be more valuable to fill\n\nIndustry/Domain Relevance (Score: 8/20):\n- The candidate's industry experience (fintech, insurance, enterprise software) typically employs higher-level languages\n- C++ is less commonly used in the web and cloud domains where the candidate specializes\n\nWhile the course offers valuable OOP concepts, the specific focus on C++ makes it less relevant given the candidate's current technology stack and career trajectory in web development and cloud technologies.",
    "hasPreReq": false,
    "hasCoreReq": false
  },
  {
    "_id": "6737e71153f6ff0e79aa3af4",
    "name": "CSYE",
    "number": "6220",
    "subjectName": "Enterprise Software Design",
    "credits": "4",
    "description": "Designed to build on previous experience in concepts of object-oriented design courses with equal focus in the three areas of architecture, design, and implementation. Instruction and hands-on exercises cover both server-side and client-side web programming. Offers students an opportunity to build a conceptual understanding and to gain practical experience with popular frameworks (Spring MVC, Hibernate, and Dojo or jQuery) that increase productivity, empower developers, and greatly simplify web development. The goal is to be able to build the server side and client side of substantial web-based, client-server, database-intensive, multitier applications.",
    "prerequisites": "CSYE 6200 with a minimum grade of B-  or  CSYE 6202 with a minimum grade of B-  or  CSYE 6205 with a minimum grade of B-",
    "corequisites": "None",
    "rank": 95,
    "pickReason": "This course (CSYE 6220 - Enterprise Software Design) shows an extremely strong alignment with the candidate's resume for the following detailed reasons:\n\n1. Skills Alignment (30/30):\n- The course's focus on Spring MVC directly matches the candidate's experience with Spring Boot at Citrix Systems\n- The web programming aspects (both client and server-side) align perfectly with the candidate's full-stack experience using ReactJS and NodeJS\n- Hibernate and database concepts align with the candidate's experience with MySQL, PostgreSQL, and MongoDB\n\n2. Career Goals Alignment (28/30):\n- The candidate's work experience at LSEG, Allstate, and Citrix all involve enterprise-level software development\n- The course's emphasis on building substantial web-based, client-server applications directly relates to their professional work\n- The frameworks taught (Spring MVC, Hibernate) are industry-standard tools the candidate is already utilizing\n\n3. Learning Gaps (19/20):\n- While the candidate has experience with Spring Boot, the course offers deeper architectural understanding\n- The enterprise-level design patterns and concepts would enhance their existing knowledge\n- The course would formalize their understanding of multi-tier applications\n\n4. Industry/Domain Relevance (18/20):\n- The enterprise software focus perfectly matches their work in financial services (LSEG) and insurance (Allstate)\n- The multi-tier application architecture aligns with their experience in building complex systems\n\nTotal Score: 95/100\n\nThis is a highly relevant course that would both reinforce the candidate's existing skills and provide deeper architectural understanding of enterprise systems they're already working with. The course's content directly applies to their current career trajectory in enterprise software development.",
    "hasPreReq": true,
    "hasCoreReq": false
  },
  {
    "_id": "6737e71253f6ff0e79aa3af5",
    "name": "CSYE",
    "number": "6225",
    "subjectName": "Network Structures and Cloud Computing",
    "credits": "4",
    "description": "Offers a practical foundation in cloud computing and hands-on experience with the tools used in cloud computing. Designed as a foundation course for cloud-aware, adept professionals. Focuses on the fundamentals of cloud computing, the principal areas of cloud architectures, cloud security, cloud governance, cloud storage, cloud virtualization, and cloud capacity. Discusses the Internet evolution that led to cloud and how cloud applications revolutionized Web applications.",
    "prerequisites": "CSYE 6200 with a minimum grade of B-  or  INFO 5100 with a minimum grade of B-  or  INFO 5100 with a minimum grade of B-",
    "corequisites": "None",
    "rank": 95,
    "pickReason": "The course 'Network Structures and Cloud Computing' demonstrates exceptionally high relevance (95/100) to the candidate's profile for the following reasons:\n\n1. Skills Alignment (30/30):\n- Direct alignment with the candidate's extensive cloud expertise (AWS, GCP, EC2, Lambda)\n- Perfect match with their DevOps skills (Terraform, Docker, CI/CD)\n- Reinforces their existing knowledge of cloud architectures and services\n\n2. Career Goals Alignment (28/30):\n- The candidate's experience at LSEG and other companies shows heavy cloud implementation\n- Their project work (NEU course recommendation RAG chatbot, Insider Shibu) demonstrates cloud architecture experience\n- Course will enhance their enterprise-level cloud computing expertise\n\n3. Learning Gaps (19/20):\n- While the candidate has practical cloud experience, the course offers fundamental theoretical knowledge\n- Provides formal education in cloud governance and security, complementing their practical experience\n\n4. Industry/Domain Relevance (18/20):\n- Directly applicable to their current work in software engineering\n- Aligns with their experience in enterprise-level cloud applications\n- Relevant to their background in distributed systems and web applications\n\nThe course is particularly valuable as it combines theoretical foundations with practical applications, perfectly complementing the candidate's existing technical expertise while providing formal education in cloud computing principles.",
    "hasPreReq": true,
    "hasCoreReq": false
  },
  {
    "_id": "6737e71253f6ff0e79aa3af6",
    "name": "CSYE",
    "number": "6230",
    "subjectName": "Operating Systems",
    "credits": "4",
    "description": "Covers basic concepts of operating systems and system programming, such as utility programs, subsystems, and multiple-program systems. Main topics include processes, interprocess communication, and synchronization; memory allocation, segmentation, and paging; loading, linking, and libraries; resource allocation, scheduling, and performance evaluation; file systems, storage devices, and I/O systems; and protection, security, and privacy. Emphasizes key concepts through code design and development.",
    "prerequisites": "INFO 6205 with a minimum grade of B-",
    "corequisites": "None",
    "rank": 85,
    "pickReason": "The Operating Systems course (CSYE 6230) shows strong relevance to the candidate's profile for the following reasons:\n\n1. Skills Alignment (30/30):\n- The course's focus on system programming, processes, and memory management aligns perfectly with the candidate's software engineering background.\n- The candidate's experience with AWS, Docker, and Linux indicates strong foundation in systems, making this course highly valuable for deeper understanding.\n- The practical emphasis through code design and development matches the candidate's hands-on engineering experience.\n\n2. Career Goals Alignment (25/30):\n- Given the candidate's role as a Software Engineer at LSEG and previous positions, understanding operating systems is crucial for system optimization and security.\n- The course content on resource allocation and performance evaluation directly relates to the candidate's work on optimizing database systems and implementing architectural improvements.\n\n3. Learning Gaps (15/20):\n- While the candidate has experience with cloud services and containerization, deeper OS knowledge would enhance their understanding of system-level operations.\n- The synchronization and IPC concepts would be valuable for their work with distributed systems and microservices.\n\n4. Industry/Domain Relevance (15/20):\n- The security and privacy components align with the candidate's work on WAF and zero-trust authentication at LSEG.\n- Understanding OS concepts is fundamental for the enterprise-level software development the candidate is involved in.\n\nTotal Score: 85/100 - This course would provide essential theoretical foundations to complement the candidate's practical experience in software engineering and system development.",
    "hasPreReq": true,
    "hasCoreReq": false
  },
  {
    "_id": "6737e71353f6ff0e79aa3af7",
    "name": "CSYE",
    "number": "6305",
    "subjectName": "Introduction to Quantum Computing with Applications",
    "credits": "4",
    "description": "Addresses how scientists and engineers can use quantum computers to simulate large quantum mechanical systems easily, which is crucial in discovery of new lifesaving drugs and new efficient materials. Quantum computers maintain an abstract state where both 0 and 1 states exist simultaneously with some probability. The course delves deeper into how such an abstract state can be realized physically and used as a computing tool to simplify algorithm implementation and execution. Offers students an opportunity to learn about the latest breakthroughs in cryptography systems (RSA), as well as fast database search; accurate weather forecasting; ultrasecure communication; and fast image recognition.",
    "prerequisites": "INFO 6205 with a minimum grade of B",
    "corequisites": "None",
    "rank": 55,
    "pickReason": "The course 'Introduction to Quantum Computing with Applications' receives a moderate relevance score of 55 based on the following analysis:\n\nStrengths:\n1. Technical Foundation: The student's background in software engineering and strong programming skills (Python, Java) provides a good foundation for understanding computational concepts.\n2. Algorithm Experience: The resume shows experience with complex systems and optimization, which could translate to quantum algorithm understanding.\n3. Cloud Computing Experience: Experience with AWS and cloud architecture shows capability to grasp complex computational systems.\n\nLimitations:\n1. Skills Alignment (15/30): While the course involves programming, it's highly specialized in quantum computing, which isn't directly aligned with the candidate's current skillset focused on web development and enterprise software.\n2. Career Goals Alignment (15/30): Based on the resume's focus on full-stack development, cloud computing, and enterprise applications, quantum computing appears tangential to the current career trajectory.\n3. Learning Gaps (15/20): The course could provide valuable knowledge in an emerging field, but it's not addressing immediate gaps in the candidate's skillset.\n4. Industry/Domain Relevance (10/20): The candidate's experience in financial services (LSEG) and insurance (Allstate) doesn't show immediate need for quantum computing applications.\n\nWhile the course offers exposure to cutting-edge technology, it's only moderately aligned with the candidate's current career path and expertise in web development and enterprise software engineering.",
    "hasPreReq": true,
    "hasCoreReq": false
  },
  {
    "_id": "6737e71353f6ff0e79aa3af8",
    "name": "CSYE",
    "number": "7105",
    "subjectName": "High-Performance Parallel Machine Learning and AI",
    "credits": "4",
    "description": "Explores the parallelization of machine learning and deep learning code that leads to high performance on heterogeneous cluster architectures. Includes the applications to a variety of domains, including image classification, speech recognition, and natural language processing, etc. Covers a brief overview of the emerging parallel computing applications. Analyzes system architectures for different kinds of parallel computing systems (shared-memory system, distributed-memory system, accelerator system, and hybrid). Offers students an opportunity to practice the principles and the practice of the emerging parallelism-based machine-learning paradigm.",
    "prerequisites": "DAMG 6105 with a minimum grade of B  or  INFO 6105 with a minimum grade of B",
    "corequisites": "None",
    "rank": 85,
    "pickReason": "The course 'High-Performance Parallel Machine Learning and AI' shows strong alignment with the candidate's profile for several reasons:\n\nStrengths (Supporting high score):\n1. The candidate has extensive experience with cloud technologies (AWS, GCP) and distributed systems, which directly relates to parallel computing architectures covered in the course.\n2. Strong programming background in Python and Java, which are commonly used in ML implementations.\n3. Experience with performance optimization (shown in LSEG role where they improved database systems and parallel processing).\n4. Project experience with AI/ML (NEU course recommendation RAG chatbot using Anthropic and GPT models).\n5. The course's focus on system architectures for parallel computing aligns with the candidate's DevOps and cloud infrastructure experience.\n\nMinor Gaps (Preventing perfect score):\n1. While the candidate has ML project experience, it's primarily focused on applications rather than the underlying parallel computing aspects.\n2. No explicit prior experience with HPC or parallel computing frameworks is mentioned in the resume.\n\nRelevance Breakdown:\n- Skills Alignment (25/30): Strong match with programming and cloud skills\n- Career Goals Alignment (25/30): Aligns well with the candidate's ML/AI project interests\n- Learning Gaps (18/20): Fills important knowledge gaps in parallel computing\n- Industry/Domain Relevance (17/20): Relevant to current tech industry trends\n\nThe course would significantly enhance the candidate's existing skillset, particularly in scaling ML applications, which is valuable given their experience with cloud platforms and AI projects.",
    "hasPreReq": true,
    "hasCoreReq": false
  },
  {
    "_id": "6737e71453f6ff0e79aa3af9",
    "name": "CSYE",
    "number": "7125",
    "subjectName": "Advanced Cloud Computing",
    "credits": "4",
    "description": "Examines a collection of repeatable, generic software design patterns such as sidecar pattern, ambassador pattern, adapter pattern, event driven, stream and batch processing, containers and container orchestration with Kubernetes, replication, partitioning, transactions, consistency, and consensus to help make the development of reliable distributed systems more approachable and efficient. Microservices, containers, and container orchestration have fundamentally changed how distributed systems are developed. Offers students an opportunity to determine which kind of technology is appropriate for which purpose and to understand how these patterns can be combined to form the foundation of a good application architecture.",
    "prerequisites": "CSYE 6225 with a minimum grade of B",
    "corequisites": "None",
    "rank": 85,
    "pickReason": "The course 'Advanced Cloud Computing' shows a strong alignment with the candidate's background and current trajectory for the following reasons:\n\n1. Skills Alignment (30/30):\n- The candidate has extensive experience with cloud technologies (AWS, GCP)\n- Strong background in containerization (Docker) mentioned in skills\n- Experience with distributed systems and microservices architecture evident from work experience\n\n2. Career Goals Alignment (25/30):\n- Course content directly relates to their enterprise-level work at LSEG where they implemented cloud-based architecture\n- The patterns and architectures taught align with their project experience in building scalable systems\n\n3. Learning Gaps (15/20):\n- While the candidate has cloud experience, the advanced patterns (sidecar, ambassador) would fill knowledge gaps\n- Kubernetes orchestration knowledge would enhance their existing container expertise\n\n4. Industry/Domain Relevance (15/20):\n- Strong relevance to their software engineering background\n- Direct application to their current role and past experiences at LSEG and Allstate\n\nThe course would significantly enhance their existing knowledge of cloud computing and distributed systems, building upon their practical experience with AWS and containerization. The advanced patterns and Kubernetes orchestration would complement their current skillset, making them more effective in designing and implementing cloud-native applications.",
    "hasPreReq": true,
    "hasCoreReq": false
  },
  {
    "_id": "6737e71453f6ff0e79aa3afa",
    "name": "CSYE",
    "number": "7200",
    "subjectName": "Big-Data System Engineering Using Scala",
    "credits": "4",
    "description": "Covers the fundamentals of functional programming with Scala and seeks to provide a basic, practical foundation for students who want to use it as a language for working with big-data platforms. Scala is one of a new breed of general-purpose functional programming languages that is strongly typed and is object oriented. It runs on the Java virtual machine and is able to share libraries from the vast collection of open-source projects written in Java. For these reasons it is readily accessible by programmers of Java, C++, and similar languages.",
    "prerequisites": "None",
    "corequisites": "None",
    "rank": 85,
    "pickReason": "The course 'CSYE 7200 - Big-Data System Engineering Using Scala' shows strong relevance to the candidate's profile for the following reasons:\n\n1. Skills Alignment (30/30):\n- The candidate has strong programming experience in Java, Python, and other languages, making Scala (which runs on JVM) easily accessible.\n- The big data focus aligns with their experience in cloud technologies (AWS, GCP) and database systems.\n\n2. Career Goals Alignment (25/30):\n- The resume shows a clear trajectory in software engineering and distributed systems.\n- Experience at LSEG and Allstate indicates work with large-scale data processing.\n- The course would enhance their ability to work with big data platforms, crucial for enterprise applications.\n\n3. Learning Gaps (15/20):\n- While the candidate has experience with multiple programming languages, Scala isn't listed.\n- Adding functional programming and big data processing skills would fill a valuable knowledge gap.\n\n4. Industry/Domain Relevance (15/20):\n- The candidate's work in financial services (LSEG) and insurance (Allstate) often involves big data processing.\n- Their project experience, particularly with recommendation systems and data privacy, would benefit from big data engineering knowledge.\n\nTotal Score: 85/100 - This represents a strong match as it builds upon existing skills while introducing valuable new capabilities in big data processing and functional programming, directly relevant to their career path in software engineering and distributed systems.",
    "hasPreReq": false,
    "hasCoreReq": false
  },
  {
    "_id": "6737e71553f6ff0e79aa3afb",
    "name": "CSYE",
    "number": "7215",
    "subjectName": "Foundations of Parallel, Concurrent, and Multithreaded Programming",
    "credits": "4",
    "description": "Covers all aspects of concurrent program design, development, and implementation utilizing the Java multithreading API/facilities. Topics covered include thread safety and lifetime issues, block structured versus explicit synchronization, intrinsic versus explicit locking, thread pools, liveness issues, deadlock, livelock, race conditions, atomicity, performance and scalability, execution policies, test strategies. Major Java multithreading API/facilities covered include synchronized blocks, wait sets, intrinsic locks and condition variables, synchronized and concurrent collections, executor framework. Comparisons between the Java multithreading API and the Posix Pthreads multithreading standard are provided.",
    "prerequisites": "CSYE 6200 with a minimum grade of B-  or  INFO 5100 with a minimum grade of B-  or  INFO 5100 with a minimum grade of B-",
    "corequisites": "None",
    "rank": 85,
    "pickReason": "The course CSYE 7215 - Foundations of Parallel, Concurrent, and Multithreaded Programming shows a strong alignment with the candidate's profile for several key reasons:\n\n1. Skills Alignment (30/30):\n- The candidate has extensive Java experience as evidenced by their work with Spring Boot and enterprise applications\n- Their experience with high-performance systems at LSEG and Citrix indicates a need for concurrent programming knowledge\n- The course's focus on Java multithreading directly complements their existing technical stack\n\n2. Career Goals Alignment (25/30):\n- The candidate's work at LSEG involved optimizing database systems and parallel processing\n- Their experience with performance optimization at Citrix suggests a career trajectory where concurrent programming is crucial\n- The course content would enhance their ability to build scalable enterprise applications\n\n3. Learning Gaps (15/20):\n- While the candidate has experience with distributed systems (AWS, microservices), specific concurrent programming knowledge would fill a valuable gap\n- The course's coverage of thread safety, synchronization, and performance optimization addresses advanced concepts they'll need\n\n4. Industry/Domain Relevance (15/20):\n- The financial technology sector (LSEG) heavily relies on concurrent programming for high-performance systems\n- Their work on performance optimization and enterprise applications aligns perfectly with the course content\n\nTotal Score: 85/100 - This is a highly relevant course that would directly enhance their current skill set and career trajectory in enterprise software development.",
    "hasPreReq": true,
    "hasCoreReq": false
  },
  {
    "_id": "6737e71553f6ff0e79aa3afc",
    "name": "CSYE",
    "number": "7220",
    "subjectName": "Deployment and Operation of Software Applications",
    "credits": "4",
    "description": "Introduces the four most popular infrastructure languages—Chef, Puppet, Ansible, and Salt— and codes with them in the same way that we code with Java, Python, C#, and Javascript. IT infrastructure languages and their underlying methods and tools, referred to as DevOps, bridge the gap between software development and software administration. Instead of recruiting CPU cycles on our laptops, we create and manage virtual IT infrastructures on a public cloud. Offers students an opportunity to learn how to manipulate virtual machines, containers, and lambdas and set up assembly lines on public clouds in the fashion of a Model T assembly line.",
    "prerequisites": "CSYE 6220 with a minimum grade of B-  or  INFO 6250 with a minimum grade of B-",
    "corequisites": "None",
    "rank": 95,
    "pickReason": "The course CSYE 7220 (Deployment and Operation of Software Applications) shows extremely high relevance to the candidate's profile for several compelling reasons:\n\n1. Skills Alignment (30/30):\n- The course covers DevOps, infrastructure languages (Chef, Puppet, Ansible, Salt) which directly aligns with the candidate's existing DevOps skills (Terraform, AWS, GCP)\n- The focus on cloud infrastructure perfectly matches their experience with EC2, Lambda, and other AWS services\n- The course's emphasis on virtual machines and containers aligns with their Docker expertise\n\n2. Career Goals Alignment (28/30):\n- The candidate's experience at LSEG and other companies shows a strong focus on cloud architecture and DevOps\n- Their project experience demonstrates interest in cloud-based applications and infrastructure\n- The course content would enhance their existing cloud and infrastructure management capabilities\n\n3. Learning Gaps (19/20):\n- While the candidate has experience with Terraform and some DevOps tools, the course would provide valuable exposure to additional infrastructure languages\n- The course would complement their existing knowledge with formal training in DevOps methodologies\n\n4. Industry/Domain Relevance (18/20):\n- The course content is highly relevant to their current role and industry focus\n- Their experience with cloud services and infrastructure automation shows direct alignment with the course material\n\nOverall Score: 95/100\n\nThis course represents an excellent fit for the candidate's profile, building directly upon their existing skills while introducing complementary technologies that would enhance their DevOps and cloud infrastructure expertise. The course's focus on practical implementation and cloud-based deployment aligns perfectly with their professional experience and apparent career trajectory in cloud and DevOps engineering.",
    "hasPreReq": true,
    "hasCoreReq": false
  },
  {
    "_id": "6737e71653f6ff0e79aa3afd",
    "name": "CSYE",
    "number": "7230",
    "subjectName": "Software Engineering",
    "credits": "4",
    "description": "Looks at the software life cycle (requirements analysis and specification, software design, coding, testing, and maintenance). Offers verification, validation, and documentation at various stages of the life cycle. Covers the Unified Modeling Language as applied to the software life cycle. Covers applications of design patterns. Overviews user interface design, software metrics, and software development environments. Emphasis is on modular software construction and development of modular libraries. Requires a small software development project.",
    "prerequisites": "CSYE 6200 (may be taken concurrently) with a minimum grade of B-  or  INFO 5100 (may be taken concurrently) with a minimum grade of B-  or  INFO 5100 (may be taken concurrently) with a minimum grade of B-",
    "corequisites": "None",
    "rank": 92,
    "pickReason": "The course CSYE 7230 - Software Engineering shows an extremely strong alignment with the candidate's profile for the following reasons:\n\n1. Skills Alignment (30/30):\n- The course covers software life cycle, which directly aligns with the candidate's experience at LSEG and Citrix where they worked on large-scale software development\n- The candidate's experience with various frameworks (Spring Boot, Micronaut, ReactJS) demonstrates their involvement in modern software development practices\n- The emphasis on modular software construction matches their experience in developing scalable applications\n\n2. Career Goals Alignment (28/30):\n- The candidate is pursuing MS in Software Engineering Systems, making this course fundamental to their academic and professional growth\n- Their professional experience shows progression in software engineering roles, making advanced software engineering concepts highly relevant\n- The course's focus on UML and design patterns will enhance their existing architectural knowledge\n\n3. Learning Gaps (18/20):\n- While the candidate has practical experience, formal training in software lifecycle management and UML will strengthen their theoretical foundation\n- The course's coverage of software metrics and development environments complements their hands-on experience\n\n4. Industry/Domain Relevance (16/20):\n- The course directly relates to their work in software development at LSEG, Allstate, and Citrix\n- The emphasis on documentation and testing aligns with enterprise software development practices they've been exposed to\n\nOverall Score: 92/100 - This course is highly relevant as it formalizes and expands upon the candidate's practical experience while providing crucial theoretical foundations in software engineering principles.",
    "hasPreReq": true,
    "hasCoreReq": false
  },
  {
    "_id": "6737e71753f6ff0e79aa3afe",
    "name": "CSYE",
    "number": "7235",
    "subjectName": "Model-Driven Architecture",
    "credits": "4",
    "description": "Develops the skills to utilize new software modeling and management techniques in each state of the life cycle of component-based software systems. Applies and extends a basic knowledge of the Unified Modeling Language (UML). Introduces and applies metamodel management concepts using the OMG metaobject facility as a technology baseline. Develops a component-based software project throughout the course using C++ or Java; grading primarily based on the software project and its public presentation.",
    "prerequisites": "INFO 6205 with a minimum grade of B-",
    "corequisites": "None",
    "rank": 85,
    "pickReason": "The course CSYE 7235 - Model-Driven Architecture shows strong alignment with the candidate's profile for several key reasons:\n\n1. Skills Alignment (30/30):\n- The course's focus on UML and component-based software systems directly complements the candidate's extensive software engineering background\n- The use of C++ or Java aligns with the candidate's programming skills (Java listed prominently)\n- The software modeling concepts align with the candidate's experience in system architecture at LSEG and Citrix\n\n2. Career Goals Alignment (25/30):\n- Based on the resume's focus on software engineering roles and architecture-heavy projects, this course provides valuable enterprise architecture skills\n- The candidate's experience with microservices and distributed systems at LSEG would be enhanced by formal modeling techniques\n\n3. Learning Gaps (15/20):\n- While the candidate has strong implementation experience, formal modeling techniques could strengthen their architectural design capabilities\n- UML and metamodel management concepts would add valuable enterprise architecture skills\n\n4. Industry/Domain Relevance (15/20):\n- The course's emphasis on component-based systems directly relates to the candidate's work in enterprise software development\n- The project-based nature matches their hands-on experience\n\nThe course would provide formal methodologies to complement the candidate's practical experience in software architecture and system design, making it highly relevant for their career progression in software engineering.",
    "hasPreReq": true,
    "hasCoreReq": false
  },
  {
    "_id": "6737e71753f6ff0e79aa3aff",
    "name": "CSYE",
    "number": "7270",
    "subjectName": "Building Virtual Environments",
    "credits": "4",
    "description": "Covers the basics of three-dimensional graphics programming using the Unity game engine. Includes a built-in terrain editor; a shader development facility; built-in physics; and advanced lighting, shadows, and audio to build 3D virtual environments and serious games. Javascript and C# can be used for scripting. Assets from various 3D modeling programs can be imported. Facilities to publish to the PC, Mac, iPhone and Wii and support for real-time multiplayer games are available. Requires a final project.",
    "prerequisites": "None",
    "corequisites": "None",
    "rank": 45,
    "pickReason": "Based on the resume analysis, CSYE 7270 (Building Virtual Environments) shows a weak to moderate match with the candidate's profile for the following reasons:\n\nSkills Alignment (Score: 10/30):\n- While the candidate has experience with JavaScript (which can be used in Unity), the focus on 3D graphics, Unity engine, and game development represents a significant departure from their current skill set.\n- The resume shows strong focus on web development, cloud technologies, and enterprise software, rather than game or virtual environment development.\n\nCareer Goals Alignment (Score: 15/30):\n- The resume indicates a career trajectory in enterprise software development and cloud computing (experiences at LSEG, Allstate, Citrix).\n- No indication of interest or career goals in game development or virtual environments.\n- Projects listed focus on web applications, chatbots, and data privacy rather than 3D or game development.\n\nLearning Gaps (Score: 12/20):\n- While learning Unity and 3D programming could add a new skill dimension, it doesn't address critical gaps in the candidate's current career path.\n- The course could provide valuable exposure to C# programming, which might be useful for .NET development.\n\nIndustry/Domain Relevance (Score: 8/20):\n- The candidate's experience is primarily in financial services, insurance, and enterprise software.\n- Virtual environment development represents a different domain from their current focus areas.\n\nWhile the course might provide some transferable programming skills (particularly in C#), it doesn't strongly align with the candidate's demonstrated career path and expertise in web development, cloud computing, and enterprise software development.",
    "hasPreReq": false,
    "hasCoreReq": false
  },
  {
    "_id": "6737e71853f6ff0e79aa3b00",
    "name": "CSYE",
    "number": "7280",
    "subjectName": "User Experience Design and Testing",
    "credits": "4",
    "description": "Introduces user experience concepts while working on Web design projects. Offers students an opportunity to build the necessary skill sets to make better decisions when designing contemporary websites that cater to customer needs. Students practice interview techniques to understand user requirements while keeping user experience central to the effort. Uses wireframes and user scenarios to drive the creative design process. Various case studies are introduced and discussed in team settings to emphasize user perspectives. Uses quality assurance and usability testing to drive validation and user-acceptance testing and approvals.",
    "prerequisites": "CSYE 6200 (may be taken concurrently) with a minimum grade of B-  or  INFO 5100 (may be taken concurrently) with a minimum grade of B-  or  INFO 5100 (may be taken concurrently) with a minimum grade of B-",
    "corequisites": "None",
    "rank": 85,
    "pickReason": "This course aligns strongly with the candidate's profile for several key reasons:\n\n1. Skills Alignment (30/30):\n- The candidate's experience shows significant web development work using ReactJS, NodeJS, and other frontend technologies\n- Their projects demonstrate UI/UX considerations (chatbot, smart device interface)\n- Direct alignment with their full-stack development experience\n\n2. Career Goals Alignment (25/30):\n- The course would enhance their ability to create better user experiences, particularly valuable given their work on customer-facing applications at LSEG and Allstate\n- Would complement their technical skills with crucial user-centric design principles\n\n3. Learning Gaps (15/20):\n- While the candidate has strong technical skills, formal UX design and testing knowledge could fill a gap in their skillset\n- Would provide structured methodology for user research and testing, which isn't explicitly mentioned in their current skill set\n\n4. Industry/Domain Relevance (15/20):\n- Highly relevant to their software engineering role and project work\n- Would enhance their ability to develop user-centric applications, particularly valuable for their work on mobile apps and web platforms\n\nOverall Score: 85/100\n\nThis course would be particularly valuable as it would add formal UX design methodology to their already strong technical implementation skills, making them more effective in creating user-centered applications. The testing component would also complement their existing quality assurance experience.",
    "hasPreReq": true,
    "hasCoreReq": false
  },
  {
    "_id": "6737e71853f6ff0e79aa3b01",
    "name": "CSYE",
    "number": "7370",
    "subjectName": "Deep Learning and Reinforcement Learning in Game Engineering",
    "credits": "4",
    "description": "Introduces a deep learning and reinforcement learning framework for games called ML-Agents, which enable games and simulations to serve as environments for training intelligent agents. Studies and reviews classical game artificial intelligence (game AI), primarily search and decision trees. Uses game AI to generate responsive, adaptive, or intelligent behaviors primarily in nonplayer characters (NPCs) similar to human-like intelligence. Game AI includes everything from simple chasing and evading to pattern movement, to create opponents with complex tactical and strategic decisions.",
    "prerequisites": "INFO 5100 with a minimum grade of B  or  INFO 5100 with a minimum grade of B  or  CSYE 6200 with a minimum grade of B",
    "corequisites": "None",
    "rank": 85,
    "pickReason": "The course CSYE 7370 (Deep Learning and Reinforcement Learning in Game Engineering) shows strong relevance to the candidate's profile for several reasons:\n\n1. Skills Alignment (30/30):\n- The candidate has strong Python programming experience, which is essential for ML-Agents and deep learning implementations\n- Experience with cloud platforms (AWS, GCP) indicates comfort with computational resources needed for deep learning\n- Prior work with AI-related projects (GPT integration, recommendation systems)\n\n2. Career Goals Alignment (25/30):\n- The candidate's recent project 'NEU course recommendation RAG chatbot' demonstrates interest and experience in AI/ML\n- Experience with building intelligent systems as shown in the Sensibo AI project\n- The course would enhance their AI capabilities, complementing their software engineering background\n\n3. Learning Gaps (15/20):\n- While the candidate has experience with AI/ML applications, specialized game AI and reinforcement learning would be valuable additions\n- The course would provide formal training in deep learning, filling a gap in their current skill set\n\n4. Industry/Domain Relevance (15/20):\n- The candidate's software engineering background at companies like LSEG and Allstate shows strong technical foundation\n- The course's focus on intelligent agents and AI aligns with their project portfolio\n\nTotal Score: 85/100\n\nThis course would be highly beneficial as it:\n1. Builds upon their existing Python and AI experience\n2. Complements their software engineering background with specialized AI knowledge\n3. Aligns with their demonstrated interest in AI/ML through various projects\n4. Provides formal training in an advanced area of AI that could differentiate their skill set",
    "hasPreReq": true,
    "hasCoreReq": false
  },
  {
    "_id": "6737e71953f6ff0e79aa3b02",
    "name": "CSYE",
    "number": "7380",
    "subjectName": "Theory and Practical Applications of AI Generative Modeling",
    "credits": "4",
    "description": "Covers transformer-based language models (e.g., ChatGPT and Bard); generative image models (e.g., GAN and variational autoencoder); and generative models for structured data (e.g., Bayesian networks). Explores generative models for data of major modalities, namely, textual, image, and structured relational. Offers students an opportunity to learn how to build such models for practical applications in different verticals using Python and numerous publicly available libraries in Keras/TensorFlow and PyTorch. Given recent surges in generative modeling tools, generative modeling technologies and applications are necessary skills for students entering the field of industrial data science.",
    "prerequisites": "INFO 6205 with a minimum grade of B",
    "corequisites": "None",
    "rank": 85,
    "pickReason": "The course CSYE 7380 (Theory and Practical Applications of AI Generative Modeling) shows strong alignment with the candidate's profile for several key reasons:\n\nStrong Matches (Contributing to high score):\n1. Skills Alignment (30/30):\n- The candidate has demonstrated Python experience, which is the primary programming language used in the course\n- Experience with GPT tools is listed in their skills\n- The candidate has already worked on AI/GPT-related projects (NEU course recommendation RAG chatbot, Sensibo AI)\n\n2. Career Goals Alignment (25/30):\n- Their recent projects show a clear interest in AI and generative models (RAG chatbot project)\n- Their experience includes working with modern technologies and implementing intelligent systems\n\n3. Learning Gaps (15/20):\n- The course would provide formal theoretical foundations for the practical AI work they're already doing\n- Would enhance their understanding of transformer models, GANs, and other advanced AI concepts\n\n4. Industry/Domain Relevance (15/20):\n- The course aligns well with their software engineering background\n- Complements their current trajectory in building AI-powered applications\n\nKey Project Alignments:\n- Their NEU course recommendation RAG chatbot project directly relates to language models\n- Sensibo AI project shows practical application of AI models\n\nThe only minor factors preventing a perfect score:\n- While they have practical experience with GPT, they might benefit from more theoretical foundations first\n- Some advanced concepts might require additional machine learning prerequisites\n\nOverall, this course would be highly beneficial for deepening their AI expertise and advancing their career in modern software engineering with AI integration.",
    "hasPreReq": true,
    "hasCoreReq": false
  },
  {
    "_id": "6737e71953f6ff0e79aa3b03",
    "name": "CSYE",
    "number": "7470",
    "subjectName": "Advanced Game Analytics",
    "credits": "4",
    "description": "Explores the use of deep learning for the automated creation and analysis of game metrics. Uses convolutional neural networks (CNNs) to segment and identify anything on a game screen in real-time, which is used as input to AI systems. The second part of the course analyzes the importance of the metrics. Covers surrogate models, Shannon entropy, Individual Conditional Expectation (ICE), leave-one-covariate-out (LOCO), local feature importance, partial dependency plots, tree-based feature importance, standardized coefficient importance, accumulated local effects (ALE) plots, and Shapley values. Lastly, covers building predictive models with game data using the following techniques: supervised learning, generative/discriminative learning, parametric/nonparametric learning, neural networks, unsupervised learning reinforcement learning, and adaptive control.",
    "prerequisites": "INFO 6105 with a minimum grade of B",
    "corequisites": "None",
    "rank": 65,
    "pickReason": "The course CSYE 7470 - Advanced Game Analytics shows moderate relevance to the candidate's profile for the following reasons:\n\nStrengths (Supporting higher score):\n1. The course involves deep learning and AI, which aligns with the candidate's experience in building AI-powered projects (NEU course recommendation RAG chatbot, Sensibo AI)\n2. The candidate has strong programming experience in Python, which is commonly used for implementing neural networks and deep learning\n3. The course's predictive modeling component aligns with the candidate's experience in data-driven applications\n\nLimitations (Supporting lower score):\n1. The candidate's professional experience (LSEG, Allstate, Citrix) focuses more on enterprise software development rather than game analytics\n2. While the candidate has AI/ML experience, it's more focused on chatbots and recommendation systems rather than game metrics and analysis\n3. The specific game analytics tools and metrics covered (Shannon entropy, ICE, LOCO) don't directly align with the candidate's current skill set\n\nScore Breakdown:\n- Skills Alignment (30%): 20/30 (Python and AI skills present, but game-specific experience absent)\n- Career Goals Alignment (30%): 15/30 (Some alignment with AI interests, but not central to current career trajectory)\n- Learning Gaps (20%): 15/20 (Would add valuable AI/ML knowledge)\n- Industry/Domain Relevance (20%): 15/20 (Relevant to software engineering but in a specialized domain)\n\nTotal: 65/100 - This represents a moderate match, indicating the course would be beneficial but not perfectly aligned with the candidate's current career direction.",
    "hasPreReq": true,
    "hasCoreReq": false
  },
  {
    "_id": "6737e71a53f6ff0e79aa3b04",
    "name": "CSYE",
    "number": "7550",
    "subjectName": "Distributed Intelligent Agents in the Metaverse",
    "credits": "4",
    "description": "Introduces the field of agent-based computing as enablers of metaverse social avatar systems. Focuses on important aspects that shape the agent’s experience within the challenging virtual-reality design and engineering landscape. Covers personal space, personified locomotion, agent aesthetics, agent social interactions, and agent’s relation to blockchain decentralized virtual identity. Students engage in projects to deliver VR platforms applicable to engineering fields such as mechanical, civil, chemical, and bioengineering. Considers distributed learning applications and certification of credentials, as well. Offers students an opportunity to learn how to configure various agent types to construct virtual worlds bursting with lively agent interactive experiences that go far beyond the constraints of the physical reality.",
    "prerequisites": "CSYE 7270 with a minimum grade of B ;  INFO 6205 with a minimum grade of B",
    "corequisites": "None",
    "rank": 45,
    "pickReason": "The course CSYE 7550 (Distributed Intelligent Agents in the Metaverse) shows limited alignment with the candidate's background for the following reasons:\n\nSkills Alignment (Score: 10/30):\n- While the candidate has strong programming skills (Python, Java, JavaScript), the resume doesn't show any experience with VR/AR technologies or agent-based systems\n- No prior work with blockchain or metaverse technologies is evident in the skills section\n\nCareer Goals Alignment (Score: 15/30):\n- The resume shows a focus on enterprise software development, cloud architecture, and web applications\n- The candidate's experience at LSEG, Allstate, and Citrix indicates a career trajectory in traditional software engineering rather than metaverse/VR development\n\nLearning Gaps (Score: 12/20):\n- While this course could introduce new technologies, they don't appear to directly address gaps relevant to the candidate's current career path\n- The focus on virtual reality and agent-based systems seems tangential to the candidate's core expertise\n\nIndustry/Domain Relevance (Score: 8/20):\n- The candidate's work experience focuses on financial technology, insurance, and enterprise software\n- The metaverse and virtual reality domains are quite different from the industries represented in the resume\n\nThe relatively low score of 45 reflects that while the course might offer interesting new perspectives, it doesn't strongly align with the candidate's demonstrated career path, current skill set, or apparent professional goals in enterprise software development and cloud architecture.",
    "hasPreReq": true,
    "hasCoreReq": false
  }
]
