[
  {
    "_id": "6737e70f53f6ff0e79aa3af1",
    "name": "CSYE",
    "number": "6200",
    "subjectName": "Concepts of Object-Oriented Design",
    "credits": "4",
    "description": "Introduces object-oriented design and programming via the Java programming language; the use of inheritance, composition, and interface classes in software design; development of Java applets and applications; study of the Java class libraries, including the swing tool kit for building human computer interfaces, the network package for development of client-server systems, and the collections’ package for data structures and sorting algorithms. Requires a course project. Requires knowledge of C programming.",
    "prerequisites": "None",
    "corequisites": "None",
    "rank": 75,
    "pickReason": "This course aligns well with the candidate's background and experience for several reasons:\n\n1. Skills Alignment (Score: 25/30):\n- The candidate has strong Java programming experience as listed in their skills\n- The course focuses on advanced Java concepts which can enhance their existing Java knowledge\n- Object-oriented design principles are essential for their current work with Spring Boot and Micronaut\n\n2. Career Goals Alignment (Score: 20/30):\n- The candidate's experience at LSEG and Citrix shows work with Java-based frameworks\n- Understanding advanced OOP concepts would benefit their enterprise application development\n- However, they already seem to have significant experience with Java frameworks\n\n3. Learning Gaps (Score: 15/20):\n- While the candidate has Java experience, deeper understanding of OOP concepts could be valuable\n- The course's focus on GUI development (swing) and network programming aligns with their full-stack development experience\n- The collections and algorithms portion could enhance their backend development skills\n\n4. Industry/Domain Relevance (Score: 15/20):\n- The course content is directly applicable to their software engineering role\n- Network programming and client-server concepts align with their cloud/DevOps experience\n- The project requirement matches their project-oriented work experience\n\nThe course receives a 75/100 because while it's highly relevant to their field and current skill set, the candidate already demonstrates significant experience with Java and object-oriented programming through their work experience. The course would be more valuable for someone with less Java experience, though it could still provide valuable theoretical foundations and advanced concepts.",
    "hasPreReq": false,
    "hasCoreReq": false
  },
  {
    "_id": "6737e71053f6ff0e79aa3af2",
    "name": "CSYE",
    "number": "6202",
    "subjectName": "Concepts of Object-Oriented Design with C#",
    "credits": "4",
    "description": "Introduces object-oriented design and programming via the C# (C-sharp) programming language and its underlying .NET platform. Covers the use of inheritance and composition in software design and development of complex C# .NET applications. Topics include classes, overloading, data abstraction, information hiding, encapsulation, inheritance, polymorphism, file processing, templates, exceptions, container classes, and low-level language features.",
    "prerequisites": "None",
    "corequisites": "None",
    "rank": 60,
    "pickReason": "The course CSYE 6202 (Concepts of Object-Oriented Design with C#) aligns moderately with the candidate's background and experience. Here's the detailed analysis:\n\nStrengths:\n1. The candidate has strong programming experience with multiple languages (Python, Java, JavaScript, TypeScript)\n2. They have worked on full-stack development projects using various frameworks\n3. Their experience at LSEG and Citrix involves complex software engineering tasks\n\nGaps and Considerations:\n1. C# and .NET are not currently in the candidate's skill set\n2. The course is introductory level while the candidate shows advanced programming experience\n3. The candidate's work primarily focuses on web technologies and cloud services\n\nRelevance Breakdown:\n- Skills Alignment (18/30): While OOP concepts align with their Java experience, C# is not in their current stack\n- Career Goals (15/30): The course could add versatility but isn't critical given their current tech stack\n- Learning Gaps (15/20): Would fill the .NET/C# knowledge gap\n- Industry Relevance (12/20): Moderate relevance to their software engineering career\n\nThe final score of 60 reflects that while the course would add value by introducing a new programming language and platform (.NET), it might be too basic given the candidate's experience level and current technology focus on web development and cloud technologies.",
    "hasPreReq": false,
    "hasCoreReq": false
  },
  {
    "_id": "6737e71053f6ff0e79aa3af3",
    "name": "CSYE",
    "number": "6205",
    "subjectName": "Concepts of Object-Oriented Design with C++",
    "credits": "4",
    "description": "Introduces object-oriented design and programming via the C++ programming language. Covers the use of inheritance and composition in software design and development of complex C++ applications. Topics include classes, overloading, data abstraction, information hiding, encapsulation, inheritance, polymorphism, file processing, templates, exceptions, container classes, and low-level language features. Requires a course project.",
    "prerequisites": "None",
    "corequisites": "None",
    "rank": 65,
    "pickReason": "The course 'CSYE 6205 - Concepts of Object-Oriented Design with C++' receives a moderate to strong relevance score of 65 based on the following analysis:\n\nStrengths:\n1. The course aligns with the candidate's software engineering background and current Master's program.\n2. Object-oriented programming concepts are fundamental to many of the technologies in their skill set (Java, Python, TypeScript).\n3. The course could enhance their understanding of low-level programming concepts, which could be valuable given their work with system optimization at LSEG.\n\nLimitations:\n1. C++ is not listed in their current skill set, suggesting this would be a new language for them.\n2. Their work experience primarily focuses on web development, cloud technologies, and high-level programming languages.\n3. Their project portfolio shows more emphasis on modern web technologies and AI/ML applications rather than systems programming.\n\nBreakdown by criteria:\n- Skills Alignment (20/30): While OOP concepts align with their background, C++ specifically isn't part of their current stack.\n- Career Goals Alignment (15/30): Their career trajectory appears more focused on full-stack and cloud development.\n- Learning Gaps (20/20): Could provide valuable low-level programming knowledge.\n- Industry/Domain Relevance (10/20): Moderate relevance to their current work in enterprise software development.\n\nWhile the course would provide valuable foundational knowledge, it's not perfectly aligned with their current career trajectory in web development and cloud technologies.",
    "hasPreReq": false,
    "hasCoreReq": false
  },
  {
    "_id": "6737e71153f6ff0e79aa3af4",
    "name": "CSYE",
    "number": "6220",
    "subjectName": "Enterprise Software Design",
    "credits": "4",
    "description": "Designed to build on previous experience in concepts of object-oriented design courses with equal focus in the three areas of architecture, design, and implementation. Instruction and hands-on exercises cover both server-side and client-side web programming. Offers students an opportunity to build a conceptual understanding and to gain practical experience with popular frameworks (Spring MVC, Hibernate, and Dojo or jQuery) that increase productivity, empower developers, and greatly simplify web development. The goal is to be able to build the server side and client side of substantial web-based, client-server, database-intensive, multitier applications.",
    "prerequisites": "CSYE 6200 with a minimum grade of B-  or  CSYE 6202 with a minimum grade of B-  or  CSYE 6205 with a minimum grade of B-",
    "corequisites": "None",
    "rank": 95,
    "pickReason": "This course (CSYE 6220 - Enterprise Software Design) is exceptionally well-aligned with the candidate's profile for several compelling reasons:\n\n1. Skills Alignment (30/30):\n- The course's focus on Spring MVC directly matches the candidate's experience with Spring Boot\n- The course covers web programming (both client and server-side), which aligns perfectly with the candidate's full-stack experience (ReactJS, NodeJS, Express)\n- Hibernate coverage complements the candidate's database expertise (MySQL, PostgreSQL, MongoDB)\n- jQuery/Dojo knowledge would enhance their existing JavaScript/TypeScript skills\n\n2. Career Goals Alignment (28/30):\n- The candidate's work experience at LSEG, Allstate, and Citrix shows a clear focus on enterprise software development\n- Their projects demonstrate interest in full-stack development and enterprise architecture\n- The course's emphasis on enterprise-level applications directly supports their career trajectory\n\n3. Learning Gaps (19/20):\n- While the candidate has experience with modern frameworks, this course would provide deeper architectural understanding\n- The course's focus on enterprise software design patterns would strengthen their existing practical experience\n\n4. Industry/Domain Relevance (18/20):\n- The course's enterprise focus perfectly matches the candidate's experience in large enterprise companies (LSEG, Allstate, Citrix)\n- The multi-tier application architecture aligns with their current work involving complex system development\n\nOverall Score: 95/100 - This course represents an ideal match for the candidate's background and career trajectory, offering both reinforcement of existing skills and valuable new perspectives on enterprise software design.",
    "hasPreReq": true,
    "hasCoreReq": false
  },
  {
    "_id": "6737e71253f6ff0e79aa3af5",
    "name": "CSYE",
    "number": "6225",
    "subjectName": "Network Structures and Cloud Computing",
    "credits": "4",
    "description": "Offers a practical foundation in cloud computing and hands-on experience with the tools used in cloud computing. Designed as a foundation course for cloud-aware, adept professionals. Focuses on the fundamentals of cloud computing, the principal areas of cloud architectures, cloud security, cloud governance, cloud storage, cloud virtualization, and cloud capacity. Discusses the Internet evolution that led to cloud and how cloud applications revolutionized Web applications.",
    "prerequisites": "CSYE 6200 with a minimum grade of B-  or  INFO 5100 with a minimum grade of B-  or  INFO 5100 with a minimum grade of B-",
    "corequisites": "None",
    "rank": 95,
    "pickReason": "The course 'Network Structures and Cloud Computing' shows extremely high relevance (95/100) to the candidate's profile for the following reasons:\n\n1. Skills Alignment (30/30):\n- Direct match with cloud technologies listed in resume (AWS, GCP, EC2, Lambda, SQS, SNS)\n- Aligns with DevOps tools mentioned (Terraform, Docker)\n- Complements existing infrastructure knowledge\n\n2. Career Goals Alignment (28/30):\n- The candidate's experience at LSEG and other companies shows heavy cloud implementation\n- Current role involves cloud security and architecture\n- Projects demonstrate cloud-based implementations\n\n3. Learning Gaps (19/20):\n- While the candidate has practical cloud experience, formal cloud architecture education would strengthen theoretical foundation\n- Course covers cloud governance and security, complementing practical experience\n\n4. Industry/Domain Relevance (18/20):\n- Strong alignment with software engineering background\n- Directly applicable to current work in enterprise software development\n- Relevant to all listed work experiences and projects\n\nSpecific Resume Alignments:\n- Work experience shows cloud implementation at LSEG\n- Projects like NEU chatbot and Insider Shibu involve cloud infrastructure\n- Strong foundation in related technologies (Docker, AWS, GCP)\n\nThis course would provide formal theoretical backing to the candidate's practical experience and enhance their cloud architecture expertise.",
    "hasPreReq": true,
    "hasCoreReq": false
  },
  {
    "_id": "6737e71253f6ff0e79aa3af6",
    "name": "CSYE",
    "number": "6230",
    "subjectName": "Operating Systems",
    "credits": "4",
    "description": "Covers basic concepts of operating systems and system programming, such as utility programs, subsystems, and multiple-program systems. Main topics include processes, interprocess communication, and synchronization; memory allocation, segmentation, and paging; loading, linking, and libraries; resource allocation, scheduling, and performance evaluation; file systems, storage devices, and I/O systems; and protection, security, and privacy. Emphasizes key concepts through code design and development.",
    "prerequisites": "INFO 6205 with a minimum grade of B-",
    "corequisites": "None",
    "rank": 85,
    "pickReason": "The Operating Systems course (CSYE 6230) shows strong relevance to the candidate's profile for several key reasons:\n\n1. Skills Alignment (30/30):\n- The course's focus on system programming, processes, and system architecture directly complements the candidate's experience with AWS, Docker, and cloud infrastructure\n- The candidate's work with Linux and cloud services indicates a foundation that would be enhanced by deep OS knowledge\n- Experience with performance optimization at LSEG and Citrix would benefit from understanding OS-level concepts\n\n2. Career Goals Alignment (25/30):\n- As a software engineer working on enterprise applications and cloud systems, understanding OS fundamentals is crucial\n- The candidate's experience with high-performance systems at LSEG suggests OS knowledge would be valuable\n- Knowledge of memory management and process synchronization would enhance their ability to develop efficient applications\n\n3. Learning Gaps (15/20):\n- While the candidate has strong application development skills, deeper OS knowledge would strengthen their system-level understanding\n- The course would provide theoretical foundations for their practical experience with containerization and cloud services\n\n4. Industry/Domain Relevance (15/20):\n- The course content aligns well with enterprise software development\n- Understanding OS concepts is valuable for cloud-native application development, which appears to be the candidate's focus\n\nTotal Score: 85/100 - This is a highly relevant course that would provide essential theoretical foundations to complement the candidate's practical experience in software engineering and cloud computing.",
    "hasPreReq": true,
    "hasCoreReq": false
  },
  {
    "_id": "6737e71353f6ff0e79aa3af7",
    "name": "CSYE",
    "number": "6305",
    "subjectName": "Introduction to Quantum Computing with Applications",
    "credits": "4",
    "description": "Addresses how scientists and engineers can use quantum computers to simulate large quantum mechanical systems easily, which is crucial in discovery of new lifesaving drugs and new efficient materials. Quantum computers maintain an abstract state where both 0 and 1 states exist simultaneously with some probability. The course delves deeper into how such an abstract state can be realized physically and used as a computing tool to simplify algorithm implementation and execution. Offers students an opportunity to learn about the latest breakthroughs in cryptography systems (RSA), as well as fast database search; accurate weather forecasting; ultrasecure communication; and fast image recognition.",
    "prerequisites": "INFO 6205 with a minimum grade of B",
    "corequisites": "None",
    "rank": 55,
    "pickReason": "Based on a thorough analysis of the resume against the Quantum Computing course description, here's the detailed evaluation:\n\nSkills Alignment (Score: 15/30):\n- The resume shows strong programming skills in Python, Java, and various modern technologies\n- While the candidate has programming experience, there's no direct quantum computing or related physics background\n- The course could provide valuable new skills, but it's tangential to current expertise\n\nCareer Goals Alignment (Score: 15/30):\n- The resume indicates a focus on software engineering, cloud computing, and web development\n- The candidate's work experience (LSEG, Allstate, Citrix) suggests enterprise software development focus\n- Quantum computing knowledge could be beneficial but isn't directly aligned with current career trajectory\n\nLearning Gaps (Score: 15/20):\n- The course would introduce entirely new concepts in quantum computing\n- Could provide valuable knowledge in emerging technology\n- Would diversify the candidate's skill set significantly\n\nIndustry/Domain Relevance (Score: 10/20):\n- Current experience is primarily in financial services, insurance, and enterprise software\n- While quantum computing has applications in cryptography (mentioned in resume through security work), it's not a primary focus\n- The course's focus on drug discovery and weather forecasting doesn't directly align with current industry experience\n\nTotal Score: 55/100 (Moderate Match)\n\nThe course would provide exposure to an emerging field but isn't strongly aligned with the candidate's current career path and expertise in enterprise software development and cloud technologies.",
    "hasPreReq": true,
    "hasCoreReq": false
  },
  {
    "_id": "6737e71353f6ff0e79aa3af8",
    "name": "CSYE",
    "number": "7105",
    "subjectName": "High-Performance Parallel Machine Learning and AI",
    "credits": "4",
    "description": "Explores the parallelization of machine learning and deep learning code that leads to high performance on heterogeneous cluster architectures. Includes the applications to a variety of domains, including image classification, speech recognition, and natural language processing, etc. Covers a brief overview of the emerging parallel computing applications. Analyzes system architectures for different kinds of parallel computing systems (shared-memory system, distributed-memory system, accelerator system, and hybrid). Offers students an opportunity to practice the principles and the practice of the emerging parallelism-based machine-learning paradigm.",
    "prerequisites": "DAMG 6105 with a minimum grade of B  or  INFO 6105 with a minimum grade of B",
    "corequisites": "None",
    "rank": 82,
    "pickReason": "The course CSYE 7105 - High-Performance Parallel Machine Learning and AI shows strong relevance to the candidate's profile for several reasons:\n\nStrengths (Supporting high score):\n1. The candidate has strong programming experience in Python, which is commonly used in ML/AI implementations.\n2. The candidate's projects demonstrate AI/ML expertise:\n   - Developed a RAG chatbot using Anthropic and GPT models\n   - Experience with Sensibo GPT and GPT-3 integration\n3. Cloud computing background (AWS, GCP) aligns with the course's focus on heterogeneous cluster architectures\n4. Software engineering background and experience with distributed systems at LSEG\n\nSkills Alignment (25/30):\n- Direct alignment with Python programming\n- Parallel processing experience from LSEG role (processing 1000+ records)\n- Cloud architecture knowledge\n\nCareer Goals Alignment (25/30):\n- Clear interest in AI/ML from projects\n- Course builds on existing ML implementation experience\n\nLearning Gaps (17/20):\n- Will enhance parallel computing knowledge\n- Provides advanced ML optimization techniques\n\nIndustry Relevance (15/20):\n- Highly relevant to current tech industry needs\n- Aligns with enterprise-scale applications\n\nMinor Gaps:\n- No specific prior experience with high-performance computing\n- Limited direct experience with parallel computing architectures\n\nOverall: The course strongly aligns with the candidate's technical background and demonstrated interest in AI/ML, making it a valuable addition to their skill set.",
    "hasPreReq": true,
    "hasCoreReq": false
  },
  {
    "_id": "6737e71453f6ff0e79aa3af9",
    "name": "CSYE",
    "number": "7125",
    "subjectName": "Advanced Cloud Computing",
    "credits": "4",
    "description": "Examines a collection of repeatable, generic software design patterns such as sidecar pattern, ambassador pattern, adapter pattern, event driven, stream and batch processing, containers and container orchestration with Kubernetes, replication, partitioning, transactions, consistency, and consensus to help make the development of reliable distributed systems more approachable and efficient. Microservices, containers, and container orchestration have fundamentally changed how distributed systems are developed. Offers students an opportunity to determine which kind of technology is appropriate for which purpose and to understand how these patterns can be combined to form the foundation of a good application architecture.",
    "prerequisites": "CSYE 6225 with a minimum grade of B",
    "corequisites": "None",
    "rank": 95,
    "pickReason": "This course shows exceptionally high relevance (95/100) based on the following analysis:\n\n1. Skills Alignment (30/30):\n- The resume shows extensive experience with cloud technologies (AWS, GCP) and containerization (Docker)\n- The course's focus on container orchestration with Kubernetes directly builds on existing Docker knowledge\n- The design patterns taught (sidecar, ambassador, adapter) are crucial for cloud-native architecture\n\n2. Career Goals Alignment (28/30):\n- The candidate's experience at LSEG and Allstate involves distributed systems and enterprise architecture\n- Course content on microservices and distributed systems perfectly aligns with their current career trajectory\n- Knowledge of advanced cloud patterns will significantly enhance their current role and future opportunities\n\n3. Learning Gaps (19/20):\n- While the candidate has experience with Docker, the course fills the crucial Kubernetes knowledge gap\n- Advanced patterns for distributed systems will complement their existing cloud knowledge\n- The course bridges the gap between basic cloud knowledge and advanced architectural patterns\n\n4. Industry/Domain Relevance (18/20):\n- The candidate's work in financial services (LSEG) and insurance (Allstate) heavily relies on distributed systems\n- Their project experience (NEU chatbot, Sensibo AI) shows interest in scalable, cloud-native applications\n- The course content directly applies to their industry focus on enterprise-scale applications\n\nThis course is particularly valuable given their experience with cloud services (AWS, GCP) and their current role involving enterprise architecture. The advanced concepts taught will directly enhance their ability to design and implement robust distributed systems.",
    "hasPreReq": true,
    "hasCoreReq": false
  },
  {
    "_id": "6737e71453f6ff0e79aa3afa",
    "name": "CSYE",
    "number": "7200",
    "subjectName": "Big-Data System Engineering Using Scala",
    "credits": "4",
    "description": "Covers the fundamentals of functional programming with Scala and seeks to provide a basic, practical foundation for students who want to use it as a language for working with big-data platforms. Scala is one of a new breed of general-purpose functional programming languages that is strongly typed and is object oriented. It runs on the Java virtual machine and is able to share libraries from the vast collection of open-source projects written in Java. For these reasons it is readily accessible by programmers of Java, C++, and similar languages.",
    "prerequisites": "None",
    "corequisites": "None",
    "rank": 72,
    "pickReason": "The CSYE 7200 Big-Data System Engineering Using Scala course shows moderate to strong relevance to the candidate's profile for the following reasons:\n\nStrengths (Contributing to higher score):\n1. The candidate's experience at LSEG and Allstate involves working with large-scale data processing and enterprise systems, making big data engineering relevant.\n2. The candidate has strong programming language experience (Java, Python) which provides a good foundation for learning Scala.\n3. The course's focus on big-data platforms aligns with the candidate's cloud experience (AWS, GCP) and database knowledge.\n4. The JVM-based nature of Scala complements the candidate's Java background.\n\nGaps (Preventing a higher score):\n1. Scala is not currently listed in the candidate's skill set, making this an entirely new language to learn.\n2. While the candidate has experience with modern frameworks (Spring Boot, Micronaut), there's no direct functional programming experience visible in the resume.\n3. The course's focus on purely functional programming concepts might require a learning curve given the candidate's primarily object-oriented background.\n\nBreakdown of Score:\n- Skills Alignment (22/30): Good foundation in related technologies but Scala represents a new paradigm\n- Career Goals Alignment (20/30): Big data engineering aligns with enterprise development experience\n- Learning Gaps (15/20): Fills important knowledge gap in functional programming and big data\n- Industry/Domain Relevance (15/20): Relevant to enterprise software development career path\n\nThe score of 72 reflects that while this course would be valuable for the candidate's career progression, particularly in big data engineering, there would be some initial learning curve in adopting functional programming paradigms with Scala.",
    "hasPreReq": false,
    "hasCoreReq": false
  },
  {
    "_id": "6737e71553f6ff0e79aa3afb",
    "name": "CSYE",
    "number": "7215",
    "subjectName": "Foundations of Parallel, Concurrent, and Multithreaded Programming",
    "credits": "4",
    "description": "Covers all aspects of concurrent program design, development, and implementation utilizing the Java multithreading API/facilities. Topics covered include thread safety and lifetime issues, block structured versus explicit synchronization, intrinsic versus explicit locking, thread pools, liveness issues, deadlock, livelock, race conditions, atomicity, performance and scalability, execution policies, test strategies. Major Java multithreading API/facilities covered include synchronized blocks, wait sets, intrinsic locks and condition variables, synchronized and concurrent collections, executor framework. Comparisons between the Java multithreading API and the Posix Pthreads multithreading standard are provided.",
    "prerequisites": "CSYE 6200 with a minimum grade of B-  or  INFO 5100 with a minimum grade of B-  or  INFO 5100 with a minimum grade of B-",
    "corequisites": "None",
    "rank": 85,
    "pickReason": "This course demonstrates a strong match with the candidate's background and career trajectory for several key reasons:\n\n1. Skills Alignment (30/30):\n- The candidate has extensive Java experience as listed in their programming languages skills\n- Their work at LSEG and Citrix involved enterprise-level applications where concurrent programming is crucial\n- The course's focus on Java multithreading directly enhances their existing Java expertise\n\n2. Career Goals Alignment (25/30):\n- Working at LSEG and dealing with high-performance systems indicates a clear need for concurrent programming expertise\n- The course content (thread safety, synchronization, performance, and scalability) directly applies to enterprise software development\n- Experience with parallel processing mentioned in LSEG role shows practical application needs\n\n3. Learning Gaps (15/20):\n- While the candidate has experience with parallel processing, the deep dive into concurrent programming concepts would fill theoretical knowledge gaps\n- Understanding of thread safety and synchronization patterns would strengthen their enterprise development capabilities\n\n4. Industry/Domain Relevance (15/20):\n- Financial technology sector (LSEG) requires high-performance, concurrent applications\n- Enterprise software development background aligns with the course's focus on scalability and performance\n\nOverall Score: 85/100 - This is a highly relevant course that would enhance the candidate's existing skillset and directly contribute to their career in enterprise software development, particularly in high-performance computing environments like financial systems.",
    "hasPreReq": true,
    "hasCoreReq": false
  },
  {
    "_id": "6737e71553f6ff0e79aa3afc",
    "name": "CSYE",
    "number": "7220",
    "subjectName": "Deployment and Operation of Software Applications",
    "credits": "4",
    "description": "Introduces the four most popular infrastructure languages—Chef, Puppet, Ansible, and Salt— and codes with them in the same way that we code with Java, Python, C#, and Javascript. IT infrastructure languages and their underlying methods and tools, referred to as DevOps, bridge the gap between software development and software administration. Instead of recruiting CPU cycles on our laptops, we create and manage virtual IT infrastructures on a public cloud. Offers students an opportunity to learn how to manipulate virtual machines, containers, and lambdas and set up assembly lines on public clouds in the fashion of a Model T assembly line.",
    "prerequisites": "CSYE 6220 with a minimum grade of B-  or  INFO 6250 with a minimum grade of B-",
    "corequisites": "None",
    "rank": 95,
    "pickReason": "CSYE 7220 shows extremely high relevance to the candidate's profile for several compelling reasons:\n\n1. Skills Alignment (30/30):\n- The course directly aligns with the candidate's DevOps skills (Terraform, AWS, Docker)\n- Infrastructure as Code (IaC) languages (Chef, Puppet, Ansible, Salt) complement existing cloud expertise\n- Virtual machine and container management perfectly matches Docker experience\n\n2. Career Goals Alignment (28/30):\n- Strong history in cloud and infrastructure roles (LSEG, Allstate)\n- Experience with AWS services (Lambda, EC2, SQS, SNS) directly relates to course content\n- Course enhances DevOps capabilities crucial for software engineering roles\n\n3. Learning Gaps (19/20):\n- Introduces additional IaC tools beyond Terraform\n- Expands container and virtualization knowledge\n- Bridges gap between development and operations, enhancing full-stack capabilities\n\n4. Industry/Domain Relevance (18/20):\n- Perfect match for software engineering systems focus\n- Aligns with cloud-native development experience\n- Relevant to enterprise-scale deployments (experience at LSEG, Allstate)\n\nThe course would significantly enhance the candidate's existing DevOps capabilities and provide advanced knowledge in infrastructure automation, directly supporting their career trajectory in software engineering and cloud computing.",
    "hasPreReq": true,
    "hasCoreReq": false
  },
  {
    "_id": "6737e71653f6ff0e79aa3afd",
    "name": "CSYE",
    "number": "7230",
    "subjectName": "Software Engineering",
    "credits": "4",
    "description": "Looks at the software life cycle (requirements analysis and specification, software design, coding, testing, and maintenance). Offers verification, validation, and documentation at various stages of the life cycle. Covers the Unified Modeling Language as applied to the software life cycle. Covers applications of design patterns. Overviews user interface design, software metrics, and software development environments. Emphasis is on modular software construction and development of modular libraries. Requires a small software development project.",
    "prerequisites": "CSYE 6200 (may be taken concurrently) with a minimum grade of B-  or  INFO 5100 (may be taken concurrently) with a minimum grade of B-  or  INFO 5100 (may be taken concurrently) with a minimum grade of B-",
    "corequisites": "None",
    "rank": 95,
    "pickReason": "This course (CSYE 7230 - Software Engineering) shows an extremely strong alignment with the candidate's profile for the following reasons:\n\n1. Skills Alignment (30/30):\n- The course covers software life cycle, which directly aligns with the candidate's experience at LSEG and Citrix where they worked on enterprise-level software development\n- The candidate's extensive experience with Java, Spring Boot, and modern software development frameworks perfectly matches the course's focus on software engineering principles\n- The emphasis on modular software construction aligns with their experience in microservices architecture\n\n2. Career Goals Alignment (28/30):\n- The candidate is pursuing MS in Software Engineering Systems, making this course fundamental to their academic progression\n- Their professional experience shows a clear software engineering career path, making this course's content directly applicable\n- The course's coverage of UML and design patterns will enhance their existing software architecture skills\n\n3. Learning Gaps (19/20):\n- While the candidate has practical experience in software development, this course will provide formal theoretical foundations\n- The focus on software metrics and verification/validation will complement their existing practical knowledge\n- The course will strengthen their understanding of software documentation and formal software life cycle processes\n\n4. Industry/Domain Relevance (18/20):\n- The course content directly relates to their work at LSEG, Allstate, and Citrix\n- The emphasis on software development environments matches their experience with various development tools and frameworks\n- The required software development project aligns with their project-based experience\n\nOverall Score: 95/100 - This course is highly relevant and will provide both theoretical foundation and practical advancement opportunities in their software engineering career.",
    "hasPreReq": true,
    "hasCoreReq": false
  },
  {
    "_id": "6737e71753f6ff0e79aa3afe",
    "name": "CSYE",
    "number": "7235",
    "subjectName": "Model-Driven Architecture",
    "credits": "4",
    "description": "Develops the skills to utilize new software modeling and management techniques in each state of the life cycle of component-based software systems. Applies and extends a basic knowledge of the Unified Modeling Language (UML). Introduces and applies metamodel management concepts using the OMG metaobject facility as a technology baseline. Develops a component-based software project throughout the course using C++ or Java; grading primarily based on the software project and its public presentation.",
    "prerequisites": "INFO 6205 with a minimum grade of B-",
    "corequisites": "None",
    "rank": 85,
    "pickReason": "The course CSYE 7235 - Model-Driven Architecture shows strong relevance to the candidate's profile for several key reasons:\n\n1. Skills Alignment (30/30):\n- The course's focus on UML and component-based software systems directly aligns with the candidate's extensive software engineering background.\n- The use of C++ or Java matches with the candidate's programming skills (Java is listed in their skills).\n- The course's emphasis on software modeling complements their experience with various frameworks and architectures.\n\n2. Career Goals Alignment (25/30):\n- Given their work at LSEG and Allstate involving complex system architectures, this course would enhance their architectural design capabilities.\n- The component-based software development knowledge would be valuable for their current trajectory in software engineering.\n\n3. Learning Gaps (15/20):\n- While the candidate has experience with various frameworks and technologies, formal training in model-driven architecture would fill a valuable knowledge gap.\n- The metamodel management concepts would add depth to their current technical expertise.\n\n4. Industry/Domain Relevance (15/20):\n- The course content is highly relevant to their current role as a Software Engineer at LSEG and past experiences.\n- The practical project component aligns well with their project-based experience.\n\nTotal Score: 85/100\n\nThe course would provide valuable architectural knowledge that complements their existing technical stack and professional experience, particularly beneficial for their current role in enterprise software development.",
    "hasPreReq": true,
    "hasCoreReq": false
  },
  {
    "_id": "6737e71753f6ff0e79aa3aff",
    "name": "CSYE",
    "number": "7270",
    "subjectName": "Building Virtual Environments",
    "credits": "4",
    "description": "Covers the basics of three-dimensional graphics programming using the Unity game engine. Includes a built-in terrain editor; a shader development facility; built-in physics; and advanced lighting, shadows, and audio to build 3D virtual environments and serious games. Javascript and C# can be used for scripting. Assets from various 3D modeling programs can be imported. Facilities to publish to the PC, Mac, iPhone and Wii and support for real-time multiplayer games are available. Requires a final project.",
    "prerequisites": "None",
    "corequisites": "None",
    "rank": 45,
    "pickReason": "Based on the resume analysis, CSYE 7270 - Building Virtual Environments shows weak to moderate relevance for the following reasons:\n\n1. Skills Alignment (Score: 10/30):\n- While the student has JavaScript experience which could be useful for Unity scripting, there's no direct experience with C# or game development\n- No prior work with 3D graphics, Unity, or similar game engines mentioned in skills\n- The core technologies used in their experience (React, Node.js, Cloud services) don't directly align with game development\n\n2. Career Goals Alignment (Score: 15/30):\n- The resume shows a clear focus on enterprise software development, cloud computing, and web applications\n- Current and past roles (LSEG, Allstate, Citrix) indicate a career path in business/enterprise software rather than game or virtual environment development\n- Projects demonstrate interest in chatbots, AI, and data privacy rather than 3D/gaming applications\n\n3. Learning Gaps (Score: 12/20):\n- While the course could provide new skills in 3D programming and game development, these skills don't appear to be critical gaps based on the career direction shown in the resume\n- The physics and graphics programming knowledge could be valuable but isn't directly aligned with current technical focus\n\n4. Industry/Domain Relevance (Score: 8/20):\n- The resume shows strong focus on enterprise software, cloud services, and web applications\n- No indication of interest or experience in gaming, virtual environments, or 3D graphics industries\n\nWhile the course could provide interesting new skills, it doesn't strongly align with the candidate's demonstrated career path and technical focus in enterprise software development and cloud computing.",
    "hasPreReq": false,
    "hasCoreReq": false
  },
  {
    "_id": "6737e71853f6ff0e79aa3b00",
    "name": "CSYE",
    "number": "7280",
    "subjectName": "User Experience Design and Testing",
    "credits": "4",
    "description": "Introduces user experience concepts while working on Web design projects. Offers students an opportunity to build the necessary skill sets to make better decisions when designing contemporary websites that cater to customer needs. Students practice interview techniques to understand user requirements while keeping user experience central to the effort. Uses wireframes and user scenarios to drive the creative design process. Various case studies are introduced and discussed in team settings to emphasize user perspectives. Uses quality assurance and usability testing to drive validation and user-acceptance testing and approvals.",
    "prerequisites": "CSYE 6200 (may be taken concurrently) with a minimum grade of B-  or  INFO 5100 (may be taken concurrently) with a minimum grade of B-  or  INFO 5100 (may be taken concurrently) with a minimum grade of B-",
    "corequisites": "None",
    "rank": 85,
    "pickReason": "The course 'User Experience Design and Testing' demonstrates strong relevance to the candidate's profile for several key reasons:\n\n1. Skills Alignment (30/30):\n- The candidate has extensive experience with frontend technologies (ReactJS, NextJS) and full-stack development\n- Direct alignment with web development skills mentioned in the resume\n- Experience at Allstate specifically mentions enhancing 'user experience'\n\n2. Career Goals Alignment (25/30):\n- The candidate's projects (NEU course recommendation chatbot, What's You app) demonstrate focus on user-centric applications\n- Professional experience shows emphasis on web applications and user interfaces\n- Will enhance their ability to create more user-friendly applications\n\n3. Learning Gaps (15/20):\n- While the candidate has strong technical skills, formal UX design methodology could complement their technical expertise\n- Would add structured approach to user testing and validation, which isn't explicitly mentioned in their current skill set\n\n4. Industry/Domain Relevance (15/20):\n- Highly relevant for software engineering roles, especially in product development\n- Complements experience at LSEG and Allstate where user interface and experience are crucial\n\nThe course would provide formal UX methodologies to complement the candidate's strong technical background, enabling them to create more user-centric applications. The focus on wireframes, user scenarios, and usability testing would enhance their current skill set, particularly valuable given their experience with frontend development and user-facing applications.",
    "hasPreReq": true,
    "hasCoreReq": false
  },
  {
    "_id": "6737e71853f6ff0e79aa3b01",
    "name": "CSYE",
    "number": "7370",
    "subjectName": "Deep Learning and Reinforcement Learning in Game Engineering",
    "credits": "4",
    "description": "Introduces a deep learning and reinforcement learning framework for games called ML-Agents, which enable games and simulations to serve as environments for training intelligent agents. Studies and reviews classical game artificial intelligence (game AI), primarily search and decision trees. Uses game AI to generate responsive, adaptive, or intelligent behaviors primarily in nonplayer characters (NPCs) similar to human-like intelligence. Game AI includes everything from simple chasing and evading to pattern movement, to create opponents with complex tactical and strategic decisions.",
    "prerequisites": "INFO 5100 with a minimum grade of B  or  INFO 5100 with a minimum grade of B  or  CSYE 6200 with a minimum grade of B",
    "corequisites": "None",
    "rank": 78,
    "pickReason": "This course (CSYE 7370) shows strong relevance to the candidate's profile for several reasons:\n\nStrengths (Why the high score):\n1. The candidate has extensive programming experience in Python and Java, which are commonly used in deep learning and ML frameworks.\n2. The candidate's projects demonstrate AI/ML interest, particularly the 'NEU course recommendation RAG chatbot' using GPT models.\n3. The candidate's work with Sensibo AI shows practical experience in intelligent systems.\n\nSkills Alignment (25/30):\n- Python skills match perfectly with ML-Agents framework requirements\n- Experience with AI/ML through GPT implementation shows foundational knowledge\n- Game engineering aspects could complement existing software engineering skills\n\nCareer Goals Alignment (23/30):\n- The course aligns well with the candidate's apparent interest in AI/ML solutions\n- Could enhance their ability to build more sophisticated AI systems\n- Adds valuable ML expertise to their full-stack development background\n\nLearning Gaps (15/20):\n- Fills knowledge gap in reinforcement learning\n- Provides structured game AI knowledge not evident in current experience\n- Introduces specialized ML frameworks (ML-Agents)\n\nIndustry/Domain Relevance (15/20):\n- AI/ML is relevant to software engineering industry\n- Game AI knowledge could be valuable in various software applications\n\nWhy not higher:\n- No direct game development experience visible in resume\n- Primary work experience is in enterprise software rather than game engineering\n- Could be slightly tangential to current enterprise software career path\n\nOverall, this course would provide valuable AI/ML knowledge while building on existing programming skills, though it may be slightly specialized given the game engineering focus.",
    "hasPreReq": true,
    "hasCoreReq": false
  },
  {
    "_id": "6737e71953f6ff0e79aa3b02",
    "name": "CSYE",
    "number": "7380",
    "subjectName": "Theory and Practical Applications of AI Generative Modeling",
    "credits": "4",
    "description": "Covers transformer-based language models (e.g., ChatGPT and Bard); generative image models (e.g., GAN and variational autoencoder); and generative models for structured data (e.g., Bayesian networks). Explores generative models for data of major modalities, namely, textual, image, and structured relational. Offers students an opportunity to learn how to build such models for practical applications in different verticals using Python and numerous publicly available libraries in Keras/TensorFlow and PyTorch. Given recent surges in generative modeling tools, generative modeling technologies and applications are necessary skills for students entering the field of industrial data science.",
    "prerequisites": "INFO 6205 with a minimum grade of B",
    "corequisites": "None",
    "rank": 85,
    "pickReason": "The course CSYE 7380 shows strong alignment with the candidate's profile for several key reasons:\n\nStrong Skills Alignment (30/30):\n- The candidate has experience with Python, which is the primary programming language used in the course\n- Projects demonstrate practical AI/ML experience (NEU course recommendation RAG chatbot, Sensibo AI)\n- Experience with modern frameworks and cloud services indicates technical readiness\n\nCareer Goals Alignment (25/30):\n- Resume shows clear progression toward AI/ML applications (GPT integration in projects)\n- Current work involves optimization and automation, which aligns with AI/ML applications\n- Projects demonstrate interest in AI-powered solutions\n\nLearning Gaps (15/20):\n- Course fills important knowledge gaps in theoretical foundations of AI/ML\n- Provides formal training in transformer models and generative AI, advancing beyond current practical experience\n- Strengthens understanding of advanced AI concepts needed for enterprise applications\n\nIndustry/Domain Relevance (15/20):\n- Directly relevant to current tech industry trends\n- Aligns with candidate's software engineering background\n- Complements existing full-stack development skills\n\nAdditional Supporting Factors:\n- Projects show hands-on experience with GPT and AI applications\n- Professional experience includes performance optimization and automation\n- Educational background in Software Engineering Systems provides necessary foundation\n\nThe total score of 85/100 reflects the strong alignment between the course content and the candidate's background, with particular emphasis on their demonstrated interest in AI applications and existing technical foundation.",
    "hasPreReq": true,
    "hasCoreReq": false
  },
  {
    "_id": "6737e71953f6ff0e79aa3b03",
    "name": "CSYE",
    "number": "7470",
    "subjectName": "Advanced Game Analytics",
    "credits": "4",
    "description": "Explores the use of deep learning for the automated creation and analysis of game metrics. Uses convolutional neural networks (CNNs) to segment and identify anything on a game screen in real-time, which is used as input to AI systems. The second part of the course analyzes the importance of the metrics. Covers surrogate models, Shannon entropy, Individual Conditional Expectation (ICE), leave-one-covariate-out (LOCO), local feature importance, partial dependency plots, tree-based feature importance, standardized coefficient importance, accumulated local effects (ALE) plots, and Shapley values. Lastly, covers building predictive models with game data using the following techniques: supervised learning, generative/discriminative learning, parametric/nonparametric learning, neural networks, unsupervised learning reinforcement learning, and adaptive control.",
    "prerequisites": "INFO 6105 with a minimum grade of B",
    "corequisites": "None",
    "rank": 45,
    "pickReason": "Based on the resume analysis, this course shows relatively weak alignment with the candidate's background and career trajectory. Here's the detailed breakdown:\n\nSkills Alignment (15/30):\n- While the candidate has strong programming skills in Python, which is commonly used in deep learning, there's no direct experience with game analytics or deep learning in their background\n- The candidate's focus appears to be on full-stack development and cloud technologies rather than game development or analytics\n\nCareer Goals Alignment (10/30):\n- The resume shows a career path focused on enterprise software development, cloud architecture, and web applications\n- No indication of interest or career direction in gaming or game analytics\n- Current roles at LSEG and previous experiences focus on different domains (finance, insurance, workplace solutions)\n\nLearning Gaps (10/20):\n- While the course could provide valuable knowledge in deep learning and analytics, it's not addressing immediate gaps in the candidate's current career path\n- The machine learning concepts could be valuable, but the gaming context makes it less relevant\n\nIndustry/Domain Relevance (10/20):\n- The candidate's experience is primarily in financial services, insurance, and enterprise software\n- No gaming industry experience or related projects mentioned\n- While the analytical concepts could be transferable, the specific gaming focus reduces relevance\n\nTotal Score: 45/100 (Weak to Moderate Match)\n\nWhile the course offers sophisticated technical content, its specific focus on game analytics and metrics doesn't strongly align with the candidate's current career trajectory in enterprise software development and cloud solutions.",
    "hasPreReq": true,
    "hasCoreReq": false
  },
  {
    "_id": "6737e71a53f6ff0e79aa3b04",
    "name": "CSYE",
    "number": "7550",
    "subjectName": "Distributed Intelligent Agents in the Metaverse",
    "credits": "4",
    "description": "Introduces the field of agent-based computing as enablers of metaverse social avatar systems. Focuses on important aspects that shape the agent’s experience within the challenging virtual-reality design and engineering landscape. Covers personal space, personified locomotion, agent aesthetics, agent social interactions, and agent’s relation to blockchain decentralized virtual identity. Students engage in projects to deliver VR platforms applicable to engineering fields such as mechanical, civil, chemical, and bioengineering. Considers distributed learning applications and certification of credentials, as well. Offers students an opportunity to learn how to configure various agent types to construct virtual worlds bursting with lively agent interactive experiences that go far beyond the constraints of the physical reality.",
    "prerequisites": "CSYE 7270 with a minimum grade of B ;  INFO 6205 with a minimum grade of B",
    "corequisites": "None",
    "rank": 40,
    "pickReason": "The course CSYE 7550 - Distributed Intelligent Agents in the Metaverse shows limited alignment with the candidate's current profile for the following reasons:\n\n1. Skills Alignment (Score: 10/30):\n- While the candidate has experience with JavaScript/TypeScript and various frameworks, there's no direct experience with VR/AR technologies or metaverse development\n- The course's focus on virtual reality and agent-based computing represents a significant departure from the candidate's current technical stack\n\n2. Career Goals Alignment (Score: 12/30):\n- Based on the resume, the candidate's career trajectory focuses on enterprise software development, cloud architecture, and security\n- The projects listed (RAG chatbot, air-conditioner control, privacy app) don't indicate a clear interest in metaverse or VR development\n\n3. Learning Gaps (Score: 8/20):\n- While the course could introduce new technologies, it doesn't address immediate gaps in the candidate's skillset relative to their current career direction\n- The blockchain and decentralized identity aspects might have some relevance to modern software engineering, but they're not central to the candidate's current work\n\n4. Industry/Domain Relevance (Score: 10/20):\n- The candidate's experience at LSEG, Allstate, and Citrix shows a focus on enterprise applications and mobile development\n- The metaverse and VR focus represents a significant shift from the candidate's current industry focus\n\nTotal Score: 40/100 - This indicates a weak match, as the course content, while innovative, doesn't strongly align with the candidate's current technical focus and career trajectory in enterprise software development and cloud architecture.",
    "hasPreReq": true,
    "hasCoreReq": false
  }
]
