[
  {
    "_id": { "$oid": "6737e70f53f6ff0e79aa3af1" },
    "name": "CSYE",
    "number": "6200",
    "subjectName": "Concepts of Object-Oriented Design",
    "credits": "4",
    "description": "Introduces object-oriented design and programming via the Java programming language; the use of inheritance, composition, and interface classes in software design; development of Java applets and applications; study of the Java class libraries, including the swing tool kit for building human computer interfaces, the network package for development of client-server systems, and the collections’ package for data structures and sorting algorithms. Requires a course project. Requires knowledge of C programming.",
    "prerequisites": "None",
    "corequisites": "None",
    "rank": 85,
    "pickReason": "The course 'CSYE 6200 - Concepts of Object-Oriented Design' shows a strong alignment with the candidate's profile for several key reasons:\n\n1. Skills Alignment (30/30):\n- The candidate lists Java as a proficient programming language\n- Experience with Spring Boot framework indicates strong Java ecosystem knowledge\n- Professional experience at LSEG and Citrix involves Java-based technologies\n\n2. Career Goals Alignment (25/30):\n- The course directly supports software engineering career path\n- Object-oriented design principles are fundamental to the candidate's current role and projects\n- Course project requirement aligns with hands-on development experience\n\n3. Learning Gaps (15/20):\n- While the candidate is proficient in Java, deeper OOP concepts could enhance architectural skills\n- GUI development (Swing) knowledge could complement existing React/Frontend experience\n- Network programming aspects could enhance full-stack capabilities\n\n4. Industry/Domain Relevance (15/20):\n- OOP concepts are central to enterprise software development (evident in LSEG and Citrix experience)\n- Client-server systems align with candidate's work on Web Application Firewall and distributed systems\n\nWhile the candidate already shows Java proficiency, this course would provide formal theoretical foundations and advanced concepts in OOP, making it highly relevant for their software engineering career. The practical project component aligns well with their hands-on experience. The only slight reduction in score is due to some overlap with existing knowledge, though the advanced concepts would still provide significant value.",
    "hasPreReq": false,
    "hasCoreReq": false
  },
  {
    "_id": { "$oid": "6737e71053f6ff0e79aa3af2" },
    "name": "CSYE",
    "number": "6202",
    "subjectName": "Concepts of Object-Oriented Design with C#",
    "credits": "4",
    "description": "Introduces object-oriented design and programming via the C# (C-sharp) programming language and its underlying .NET platform. Covers the use of inheritance and composition in software design and development of complex C# .NET applications. Topics include classes, overloading, data abstraction, information hiding, encapsulation, inheritance, polymorphism, file processing, templates, exceptions, container classes, and low-level language features.",
    "prerequisites": "None",
    "corequisites": "None",
    "rank": 70,
    "pickReason": "The course CSYE 6202 (Concepts of Object-Oriented Design with C#) shows moderate to strong relevance to the candidate's profile for the following reasons:\n\nStrengths (Contributing to higher score):\n1. The candidate has strong programming experience with similar object-oriented languages (Java, Python)\n2. Professional experience includes software engineering roles requiring strong programming fundamentals\n3. The course aligns with the candidate's Master's in Software Engineering Systems program\n4. The .NET platform knowledge could complement their existing full-stack development skills\n\nLimitations (Preventing a higher score):\n1. C# is not listed in their current skill set, though they have experience with similar languages\n2. Their work experience shows more focus on web development, cloud technologies, and distributed systems\n3. The candidate's projects and experience indicate advanced-level work, while this appears to be an introductory OOP course\n\nBreakdown by Criteria:\n- Skills Alignment (20/30): Strong programming background but C# specific knowledge gap\n- Career Goals Alignment (20/30): Useful but not critical given current trajectory\n- Learning Gaps (15/20): Would fill C# knowledge gap\n- Industry/Domain Relevance (15/20): Relevant to software development but not central to current focus\n\nOverall, while the course would be beneficial, it might be more introductory than optimal given the candidate's current expertise level.",
    "hasPreReq": false,
    "hasCoreReq": false
  },
  {
    "_id": { "$oid": "6737e71053f6ff0e79aa3af3" },
    "name": "CSYE",
    "number": "6205",
    "subjectName": "Concepts of Object-Oriented Design with C++",
    "credits": "4",
    "description": "Introduces object-oriented design and programming via the C++ programming language. Covers the use of inheritance and composition in software design and development of complex C++ applications. Topics include classes, overloading, data abstraction, information hiding, encapsulation, inheritance, polymorphism, file processing, templates, exceptions, container classes, and low-level language features. Requires a course project.",
    "prerequisites": "None",
    "corequisites": "None",
    "rank": 85,
    "pickReason": "The course 'CSYE 6205 - Concepts of Object-Oriented Design with C++' shows strong relevance to the candidate's profile for several key reasons:\n\nStrengths (Contributing to high score):\n1. The candidate's background in software engineering (both MS and BE) aligns perfectly with advanced programming concepts.\n2. Professional experience at LSEG, Allstate, and Citrix involves complex software development where OOP principles are fundamental.\n3. While C++ isn't listed in their current skill set, the candidate shows strong programming language proficiency (Python, Java, TypeScript) which indicates strong ability to learn new languages.\n4. The course's focus on software design patterns and OOP concepts directly complements their work on large-scale applications at LSEG and Citrix.\n\nGaps/Considerations:\n1. C++ isn't currently in their skill set, but the OOP concepts transfer well from their Java experience.\n2. The course's emphasis on low-level language features could enhance their understanding of system-level programming.\n\nCore Alignment Breakdown:\n- Skills Alignment (25/30): Strong match with programming background, though C++ specific experience is missing\n- Career Goals Alignment (28/30): Perfect for software engineering career trajectory\n- Learning Gaps (17/20): Fills important knowledge gap in C++ and low-level programming\n- Industry Relevance (15/20): Highly relevant for software engineering industry\n\nTotal Score: 85/100 - This represents a strong match given the candidate's software engineering focus and the course's emphasis on fundamental programming concepts that would enhance their existing skill set.",
    "hasPreReq": false,
    "hasCoreReq": false
  },
  {
    "_id": { "$oid": "6737e71153f6ff0e79aa3af4" },
    "name": "CSYE",
    "number": "6220",
    "subjectName": "Enterprise Software Design",
    "credits": "4",
    "description": "Designed to build on previous experience in concepts of object-oriented design courses with equal focus in the three areas of architecture, design, and implementation. Instruction and hands-on exercises cover both server-side and client-side web programming. Offers students an opportunity to build a conceptual understanding and to gain practical experience with popular frameworks (Spring MVC, Hibernate, and Dojo or jQuery) that increase productivity, empower developers, and greatly simplify web development. The goal is to be able to build the server side and client side of substantial web-based, client-server, database-intensive, multitier applications.",
    "prerequisites": "CSYE 6200 with a minimum grade of B-  or  CSYE 6202 with a minimum grade of B-  or  CSYE 6205 with a minimum grade of B-",
    "corequisites": "None",
    "rank": 90,
    "pickReason": "This course (CSYE 6220 - Enterprise Software Design) is highly relevant to the candidate's profile for several compelling reasons:\n\n1. Skills Alignment (30/30):\n- The course's focus on Spring MVC aligns perfectly with the candidate's experience with Spring Boot\n- The course covers web programming (both client and server-side) which matches the candidate's extensive full-stack experience (ReactJS, NodeJS, Express)\n- Hibernate framework teaching complements the candidate's database expertise (MySQL, Postgres, MongoDB)\n- jQuery/Dojo learning would enhance their existing JavaScript/TypeScript skills\n\n2. Career Goals Alignment (28/30):\n- The candidate's work experience at LSEG and Citrix shows strong involvement in enterprise software development\n- Their project portfolio demonstrates full-stack application development, making enterprise software design highly relevant\n- The course's focus on multitier applications directly relates to their current work in building scalable systems\n\n3. Learning Gaps (18/20):\n- While the candidate has experience with modern frameworks, this course would provide deeper architectural understanding\n- The course would strengthen their enterprise-level design patterns knowledge\n- Formal training in multitier architecture would complement their practical experience\n\n4. Industry/Domain Relevance (16/20):\n- The course's enterprise focus aligns with their experience in large organizations (LSEG, Allstate, Citrix)\n- The technologies covered are currently used in their professional work\n\nOverall Score: 90/100 - This course is an excellent match for the candidate's profile, offering both reinforcement of existing skills and valuable new perspectives on enterprise software design.",
    "hasPreReq": true,
    "hasCoreReq": false
  },
  {
    "_id": { "$oid": "6737e71253f6ff0e79aa3af5" },
    "name": "CSYE",
    "number": "6225",
    "subjectName": "Network Structures and Cloud Computing",
    "credits": "4",
    "description": "Offers a practical foundation in cloud computing and hands-on experience with the tools used in cloud computing. Designed as a foundation course for cloud-aware, adept professionals. Focuses on the fundamentals of cloud computing, the principal areas of cloud architectures, cloud security, cloud governance, cloud storage, cloud virtualization, and cloud capacity. Discusses the Internet evolution that led to cloud and how cloud applications revolutionized Web applications.",
    "prerequisites": "CSYE 6200 with a minimum grade of B-  or  INFO 5100 with a minimum grade of B-  or  INFO 5100 with a minimum grade of B-",
    "corequisites": "None",
    "rank": 95,
    "pickReason": "This course shows extremely high relevance (95/100) to the candidate's profile for the following reasons:\n\n1. Skills Alignment (30/30):\n- The candidate has extensive experience with AWS services (EC2, Lambda, SQS, SNS)\n- Strong background in cloud technologies (AWS, GCP)\n- Experience with cloud infrastructure tools (Terraform)\n- The course directly builds upon and enhances these existing cloud computing skills\n\n2. Career Goals Alignment (28/30):\n- The candidate's work experience at LSEG shows direct implementation of cloud architecture and security\n- Professional experience involves cloud-based solutions and distributed systems\n- This course would enhance their existing cloud expertise and career trajectory\n\n3. Learning Gaps (19/20):\n- While the candidate has practical cloud experience, this course offers comprehensive theoretical foundations\n- Covers additional aspects like cloud governance and virtualization that could enhance their existing knowledge\n\n4. Industry/Domain Relevance (18/20):\n- Perfectly aligns with the candidate's current industry focus\n- All three of their professional experiences (LSEG, Allstate, Citrix) involve cloud technologies\n- Their projects demonstrate active involvement in cloud-based solutions\n\nSpecific Evidence of Strong Match:\n- Their LSEG experience includes implementing zero-trust IAM authentication and AWS architecture\n- Projects like the NEU course recommendation RAG chatbot show cloud implementation experience\n- Their skill set includes extensive cloud services and infrastructure tools\n\nThis course would provide both theoretical foundation and practical enhancement to their existing cloud computing expertise, making it an excellent match for their profile and career trajectory.",
    "hasPreReq": true,
    "hasCoreReq": false
  },
  {
    "_id": { "$oid": "6737e71253f6ff0e79aa3af6" },
    "name": "CSYE",
    "number": "6230",
    "subjectName": "Operating Systems",
    "credits": "4",
    "description": "Covers basic concepts of operating systems and system programming, such as utility programs, subsystems, and multiple-program systems. Main topics include processes, interprocess communication, and synchronization; memory allocation, segmentation, and paging; loading, linking, and libraries; resource allocation, scheduling, and performance evaluation; file systems, storage devices, and I/O systems; and protection, security, and privacy. Emphasizes key concepts through code design and development.",
    "prerequisites": "INFO 6205 with a minimum grade of B-",
    "corequisites": "None",
    "rank": 85,
    "pickReason": "This Operating Systems course (CSYE 6230) shows strong relevance to the candidate's profile for several key reasons:\n\n1. Skills Alignment (30/30):\n- The course's focus on system programming, processes, and system architecture directly complements the candidate's extensive experience with AWS, Docker, and cloud services\n- The candidate's work with infrastructure and distributed systems at LSEG shows direct application of OS concepts\n- Experience with Linux listed in skills indicates foundational knowledge that will be enhanced\n\n2. Career Goals Alignment (25/30):\n- As a software engineer working on enterprise-level systems (LSEG, Allstate), deep OS knowledge is crucial\n- The course's coverage of performance evaluation and resource allocation directly relates to the candidate's optimization work at LSEG\n- Understanding of processes and IPC is vital for the distributed systems work evident in their experience\n\n3. Learning Gaps (15/20):\n- While the candidate has practical experience with systems, formal OS education will provide theoretical foundation\n- Topics like memory management and scheduling will enhance their ability to optimize applications\n- Security and protection concepts align with their WAF implementation experience\n\n4. Industry/Domain Relevance (15/20):\n- The systems programming focus is highly relevant to enterprise software development\n- Topics covered are fundamental to cloud computing and distributed systems\n- Knowledge of OS concepts is crucial for performance optimization work mentioned in their experience\n\nOverall Score: 85/100 - This course is highly relevant as it provides both theoretical foundation and practical knowledge that directly enhances the candidate's current skill set and career trajectory in systems and enterprise software development.",
    "hasPreReq": true,
    "hasCoreReq": false
  },
  {
    "_id": { "$oid": "6737e71353f6ff0e79aa3af7" },
    "name": "CSYE",
    "number": "6305",
    "subjectName": "Introduction to Quantum Computing with Applications",
    "credits": "4",
    "description": "Addresses how scientists and engineers can use quantum computers to simulate large quantum mechanical systems easily, which is crucial in discovery of new lifesaving drugs and new efficient materials. Quantum computers maintain an abstract state where both 0 and 1 states exist simultaneously with some probability. The course delves deeper into how such an abstract state can be realized physically and used as a computing tool to simplify algorithm implementation and execution. Offers students an opportunity to learn about the latest breakthroughs in cryptography systems (RSA), as well as fast database search; accurate weather forecasting; ultrasecure communication; and fast image recognition.",
    "prerequisites": "INFO 6205 with a minimum grade of B",
    "corequisites": "None",
    "rank": 45,
    "pickReason": "Based on the provided resume, the relevance of CSYE 6305 - Introduction to Quantum Computing with Applications receives a moderate-to-low score of 45 for the following reasons:\n\nSkills Alignment (Score: 10/30):\n- The resume shows strong expertise in traditional software engineering (Python, Java, Cloud technologies)\n- While Python skills could be useful for quantum computing simulations, there's no direct quantum computing or related physics background evident\n- The course focuses on specialized quantum concepts that don't directly build on the candidate's current technical stack\n\nCareer Goals Alignment (Score: 15/30):\n- The resume indicates a career focus on web development, cloud computing, and enterprise software engineering\n- The candidate's work experience (LSEG, Allstate, Citrix) and projects show emphasis on web applications and cloud services\n- Quantum computing applications (cryptography, database search) could be tangentially relevant but aren't central to the current career trajectory\n\nLearning Gaps (Score: 10/20):\n- While the course would introduce new knowledge, it doesn't address immediate gaps in the candidate's current professional direction\n- The prerequisite of INFO 6205 suggests foundational knowledge that may be valuable, but the quantum computing specialization might not be the most efficient next step\n\nIndustry/Domain Relevance (Score: 10/20):\n- The candidate's experience is primarily in financial technology, insurance, and enterprise software\n- While quantum computing has future applications in these sectors, it's not currently a core technology in these domains\n\nRecommendation: Given the candidate's strong background in traditional software engineering and cloud technologies, courses focused on advanced cloud architecture, distributed systems, or AI/ML might be more immediately beneficial for their career trajectory.",
    "hasPreReq": true,
    "hasCoreReq": false
  },
  {
    "_id": { "$oid": "6737e71353f6ff0e79aa3af8" },
    "name": "CSYE",
    "number": "7105",
    "subjectName": "High-Performance Parallel Machine Learning and AI",
    "credits": "4",
    "description": "Explores the parallelization of machine learning and deep learning code that leads to high performance on heterogeneous cluster architectures. Includes the applications to a variety of domains, including image classification, speech recognition, and natural language processing, etc. Covers a brief overview of the emerging parallel computing applications. Analyzes system architectures for different kinds of parallel computing systems (shared-memory system, distributed-memory system, accelerator system, and hybrid). Offers students an opportunity to practice the principles and the practice of the emerging parallelism-based machine-learning paradigm.",
    "prerequisites": "DAMG 6105 with a minimum grade of B  or  INFO 6105 with a minimum grade of B",
    "corequisites": "None",
    "rank": 85,
    "pickReason": "Based on the resume analysis, CSYE 7105 (High-Performance Parallel Machine Learning and AI) shows strong relevance for the following reasons:\n\nSkills Alignment (30/30):\n- The candidate shows strong proficiency in Python, which is essential for ML/AI implementations\n- Experience with cloud platforms (AWS, GCP) aligns with the course's focus on heterogeneous cluster architectures\n- Database expertise (MySQL, PostgreSQL, MongoDB) is valuable for handling large-scale ML data\n\nCareer Goals Alignment (25/30):\n- Projects like 'NEU course recommendation RAG chatbot' demonstrate direct interest in AI/ML applications\n- Experience at LSEG with parallel processing and optimization shows alignment with the course's focus on high-performance computing\n- The candidate's work on performance optimization at Citrix indicates interest in system performance\n\nLearning Gaps (15/20):\n- Course fills crucial knowledge gaps in parallel computing and ML optimization\n- Provides advanced understanding of heterogeneous architectures, which isn't evident in current skill set\n\nIndustry/Domain Relevance (15/20):\n- Highly relevant to software engineering systems (candidate's current Master's program)\n- Aligns with emerging industry trends in AI/ML optimization\n- Complements existing experience with cloud architectures and distributed systems\n\nThe overall score of 85 reflects the strong alignment between the course content and the candidate's technical background, particularly in software engineering and ML/AI interests, while acknowledging some room for growth in specialized parallel computing concepts.",
    "hasPreReq": true,
    "hasCoreReq": false
  },
  {
    "_id": { "$oid": "6737e71453f6ff0e79aa3af9" },
    "name": "CSYE",
    "number": "7125",
    "subjectName": "Advanced Cloud Computing",
    "credits": "4",
    "description": "Examines a collection of repeatable, generic software design patterns such as sidecar pattern, ambassador pattern, adapter pattern, event driven, stream and batch processing, containers and container orchestration with Kubernetes, replication, partitioning, transactions, consistency, and consensus to help make the development of reliable distributed systems more approachable and efficient. Microservices, containers, and container orchestration have fundamentally changed how distributed systems are developed. Offers students an opportunity to determine which kind of technology is appropriate for which purpose and to understand how these patterns can be combined to form the foundation of a good application architecture.",
    "prerequisites": "CSYE 6225 with a minimum grade of B",
    "corequisites": "None",
    "rank": 95,
    "pickReason": "The course CSYE 7125 - Advanced Cloud Computing shows extremely high relevance to the candidate's profile for several compelling reasons:\n\n1. Skills Alignment (30/30):\n- The candidate has strong experience with cloud technologies (AWS, GCP) and container orchestration (Docker)\n- Direct alignment with microservices architecture mentioned in their LSEG experience\n- Perfect match with their current technology stack including containerization tools\n\n2. Career Goals Alignment (28/30):\n- The course's focus on distributed systems and cloud architecture directly builds upon their enterprise-level experience at LSEG and Citrix\n- Strong alignment with their current career trajectory in cloud-native applications and distributed systems\n- Their project experience shows interest in scalable cloud applications\n\n3. Learning Gaps (19/20):\n- While the candidate has experience with Docker, the advanced Kubernetes content would fill a crucial knowledge gap\n- The course's focus on design patterns would enhance their architectural decision-making capabilities\n- The transaction and consensus patterns would complement their existing database knowledge\n\n4. Industry/Domain Relevance (18/20):\n- Perfect alignment with their current industry focus on cloud-native applications\n- Relevant to their experience in building scalable systems at LSEG\n- Directly applicable to their work with microservices and distributed systems\n\nThe course would provide advanced knowledge building perfectly upon their existing experience while filling crucial gaps in distributed systems patterns and Kubernetes orchestration. The pre-requisite of CSYE 6225 ensures they have the foundational knowledge to succeed in this advanced course.",
    "hasPreReq": true,
    "hasCoreReq": false
  },
  {
    "_id": { "$oid": "6737e71453f6ff0e79aa3afa" },
    "name": "CSYE",
    "number": "7200",
    "subjectName": "Big-Data System Engineering Using Scala",
    "credits": "4",
    "description": "Covers the fundamentals of functional programming with Scala and seeks to provide a basic, practical foundation for students who want to use it as a language for working with big-data platforms. Scala is one of a new breed of general-purpose functional programming languages that is strongly typed and is object oriented. It runs on the Java virtual machine and is able to share libraries from the vast collection of open-source projects written in Java. For these reasons it is readily accessible by programmers of Java, C++, and similar languages.",
    "prerequisites": "None",
    "corequisites": "None",
    "rank": 75,
    "pickReason": "Based on the provided resume, CSYE 7200 - Big-Data System Engineering Using Scala receives a score of 75 for the following reasons:\n\nStrengths (Why it's relevant):\n1. The candidate has strong programming experience (Python, Java) which provides a good foundation for learning Scala.\n2. They have worked with big data platforms and cloud services (AWS, GCP) which aligns with the course's focus on big-data systems.\n3. The candidate's project experience (NEU course recommendation RAG chatbot, What's You) demonstrates work with data-intensive applications.\n4. Their current role at LSEG involves working with large-scale data systems and optimization.\n\nModerate Match Factors:\n1. While Scala isn't currently in their skill set, their proficiency in Java makes it accessible given Scala's JVM compatibility.\n2. The course would fill a valuable skill gap in functional programming, which isn't currently represented in their toolkit.\n3. The big data focus aligns with their current career trajectory in software engineering systems.\n\nLimitations (Why not higher):\n1. Scala isn't directly mentioned in their current skill set or job requirements.\n2. Their recent work focuses more on web applications and mobile development rather than pure big data engineering.\n3. Their current tech stack (React, Node.js, Spring Boot) is primarily oriented towards web development.\n\nThis course would provide valuable complementary knowledge to their existing skill set while opening up new opportunities in big data engineering, making it a solid match but not perfect alignment with their current career direction.",
    "hasPreReq": false,
    "hasCoreReq": false
  },
  {
    "_id": { "$oid": "6737e71553f6ff0e79aa3afb" },
    "name": "CSYE",
    "number": "7215",
    "subjectName": "Foundations of Parallel, Concurrent, and Multithreaded Programming",
    "credits": "4",
    "description": "Covers all aspects of concurrent program design, development, and implementation utilizing the Java multithreading API/facilities. Topics covered include thread safety and lifetime issues, block structured versus explicit synchronization, intrinsic versus explicit locking, thread pools, liveness issues, deadlock, livelock, race conditions, atomicity, performance and scalability, execution policies, test strategies. Major Java multithreading API/facilities covered include synchronized blocks, wait sets, intrinsic locks and condition variables, synchronized and concurrent collections, executor framework. Comparisons between the Java multithreading API and the Posix Pthreads multithreading standard are provided.",
    "prerequisites": "CSYE 6200 with a minimum grade of B-  or  INFO 5100 with a minimum grade of B-  or  INFO 5100 with a minimum grade of B-",
    "corequisites": "None",
    "rank": 85,
    "pickReason": "The course CSYE 7215 - Foundations of Parallel, Concurrent, and Multithreaded Programming shows strong alignment with the candidate's resume for several key reasons:\n\nSkills Alignment (30/30):\n- The candidate has proficient Java experience, which is the primary language used in this course\n- Their work at LSEG and Citrix involved complex backend systems where concurrent programming knowledge is crucial\n- The course perfectly complements their existing Spring Boot and Micronaut expertise\n\nCareer Goals Alignment (25/30):\n- The candidate's experience in optimizing database systems and implementing parallel processing at LSEG directly relates to the course content\n- Their work on performance optimization at Citrix would benefit from deep understanding of concurrent programming\n\nLearning Gaps (15/20):\n- While the candidate has experience with distributed systems (AWS, microservices), formal education in concurrent programming would strengthen their theoretical foundation\n- Understanding thread safety and synchronization is crucial for their current role involving critical financial systems\n\nIndustry/Domain Relevance (15/20):\n- The financial technology sector (LSEG) requires highly concurrent, performant systems\n- The course's focus on performance, scalability, and thread safety directly applies to their work\n\nThe total score of 85 reflects the strong alignment between the course content and the candidate's professional background and career trajectory in backend systems development.",
    "hasPreReq": true,
    "hasCoreReq": false
  },
  {
    "_id": { "$oid": "6737e71553f6ff0e79aa3afc" },
    "name": "CSYE",
    "number": "7220",
    "subjectName": "Deployment and Operation of Software Applications",
    "credits": "4",
    "description": "Introduces the four most popular infrastructure languages—Chef, Puppet, Ansible, and Salt— and codes with them in the same way that we code with Java, Python, C#, and Javascript. IT infrastructure languages and their underlying methods and tools, referred to as DevOps, bridge the gap between software development and software administration. Instead of recruiting CPU cycles on our laptops, we create and manage virtual IT infrastructures on a public cloud. Offers students an opportunity to learn how to manipulate virtual machines, containers, and lambdas and set up assembly lines on public clouds in the fashion of a Model T assembly line.",
    "prerequisites": "CSYE 6220 with a minimum grade of B-  or  INFO 6250 with a minimum grade of B-",
    "corequisites": "None",
    "rank": 85,
    "pickReason": "This course (CSYE 7220) shows strong alignment with the candidate's profile for several key reasons:\n\n1. Skills Alignment (30/30):\n- The candidate's resume shows strong DevOps experience with tools like Terraform, AWS, Docker, and CI/CD\n- The course's focus on Chef, Puppet, Ansible, and Salt directly complements their existing DevOps toolkit\n- The cloud infrastructure focus aligns perfectly with their AWS and GCP experience\n\n2. Career Goals Alignment (25/30):\n- Based on their experience at LSEG and other roles, they're heavily involved in cloud and infrastructure work\n- The course's emphasis on infrastructure as code and DevOps practices directly supports their career trajectory\n- The hands-on nature of managing virtual machines and containers aligns with their practical experience\n\n3. Learning Gaps (15/20):\n- While they have experience with some DevOps tools, the course introduces additional infrastructure languages\n- Learning Chef, Puppet, Ansible, and Salt would round out their DevOps expertise\n- The assembly line approach to cloud infrastructure would enhance their existing knowledge\n\n4. Industry/Domain Relevance (15/20):\n- Their work at LSEG and other companies involves cloud infrastructure and DevOps\n- The course's focus on modern DevOps practices is highly relevant to their industry\n\nTotal Score: 85/100\n\nThis course would be highly beneficial for the candidate as it builds upon their existing DevOps knowledge while introducing new infrastructure languages and methodologies that would make them more versatile in their field.",
    "hasPreReq": true,
    "hasCoreReq": false
  },
  {
    "_id": { "$oid": "6737e71653f6ff0e79aa3afd" },
    "name": "CSYE",
    "number": "7230",
    "subjectName": "Software Engineering",
    "credits": "4",
    "description": "Looks at the software life cycle (requirements analysis and specification, software design, coding, testing, and maintenance). Offers verification, validation, and documentation at various stages of the life cycle. Covers the Unified Modeling Language as applied to the software life cycle. Covers applications of design patterns. Overviews user interface design, software metrics, and software development environments. Emphasis is on modular software construction and development of modular libraries. Requires a small software development project.",
    "prerequisites": "CSYE 6200 (may be taken concurrently) with a minimum grade of B-  or  INFO 5100 (may be taken concurrently) with a minimum grade of B-  or  INFO 5100 (may be taken concurrently) with a minimum grade of B-",
    "corequisites": "None",
    "rank": 95,
    "pickReason": "The course CSYE 7230 - Software Engineering shows an extremely strong alignment with the candidate's profile for the following reasons:\n\n1. Skills Alignment (30/30):\n- The course's focus on software lifecycle, UML, and design patterns directly complements the candidate's extensive software engineering experience at LSEG, Allstate, and Citrix\n- The emphasis on modular software construction aligns perfectly with the candidate's experience in microservices architecture and modern development frameworks (Spring Boot, Micronaut)\n\n2. Career Goals Alignment (28/30):\n- The candidate is pursuing a Master's in Software Engineering Systems, making this course fundamentally aligned with their academic goals\n- Their professional experience shows a clear career path in software engineering, making this course's comprehensive coverage highly relevant\n\n3. Learning Gaps (19/20):\n- The course's coverage of software metrics and development environments complements their existing knowledge of CI/CD and development tools\n- The focus on software testing and maintenance adds formal methodology to their practical experience\n\n4. Industry/Domain Relevance (18/20):\n- The course content directly applies to their work in enterprise software development\n- The emphasis on documentation and verification aligns with their experience in developing critical systems like WAF at LSEG\n\nThe course represents a perfect complement to both their academic pursuit and professional experience, offering a theoretical foundation to their practical expertise while introducing advanced concepts in software engineering methodology.",
    "hasPreReq": true,
    "hasCoreReq": false
  },
  {
    "_id": { "$oid": "6737e71753f6ff0e79aa3afe" },
    "name": "CSYE",
    "number": "7235",
    "subjectName": "Model-Driven Architecture",
    "credits": "4",
    "description": "Develops the skills to utilize new software modeling and management techniques in each state of the life cycle of component-based software systems. Applies and extends a basic knowledge of the Unified Modeling Language (UML). Introduces and applies metamodel management concepts using the OMG metaobject facility as a technology baseline. Develops a component-based software project throughout the course using C++ or Java; grading primarily based on the software project and its public presentation.",
    "prerequisites": "INFO 6205 with a minimum grade of B-",
    "corequisites": "None",
    "rank": 85,
    "pickReason": "The course CSYE 7235 - Model-Driven Architecture shows strong alignment with the candidate's profile for several key reasons:\n\nStrong Matches (Contributing to high score):\n1. The candidate has extensive experience in software engineering, including roles at LSEG and Citrix where system architecture was a key focus.\n2. The course's emphasis on component-based software systems aligns with the candidate's experience in microservices and distributed systems.\n3. The practical project component using Java/C++ directly matches the candidate's proficiency in Java.\n4. The focus on UML and software modeling aligns with the enterprise-level development experience shown in the resume.\n\nSkills Alignment (30/30):\n- Direct match with Java programming skills\n- Aligns with software architecture experience from previous roles\n- Complements existing full-stack development knowledge\n\nCareer Goals Alignment (25/30):\n- Strengthens architectural design capabilities crucial for senior engineering roles\n- Enhances software modeling skills valuable in enterprise environments\n\nLearning Gaps (15/20):\n- Provides formal training in modeling and architecture, which could enhance existing practical experience\n- Offers structured approach to component-based development\n\nIndustry/Domain Relevance (15/20):\n- Highly relevant to enterprise software development\n- Applicable across financial services and technology sectors where the candidate has experience\n\nTotal Score: 85/100\n\nThe course would provide valuable theoretical foundation and practical experience in software architecture, complementing the candidate's existing technical expertise and career trajectory in software engineering.",
    "hasPreReq": true,
    "hasCoreReq": false
  },
  {
    "_id": { "$oid": "6737e71753f6ff0e79aa3aff" },
    "name": "CSYE",
    "number": "7270",
    "subjectName": "Building Virtual Environments",
    "credits": "4",
    "description": "Covers the basics of three-dimensional graphics programming using the Unity game engine. Includes a built-in terrain editor; a shader development facility; built-in physics; and advanced lighting, shadows, and audio to build 3D virtual environments and serious games. Javascript and C# can be used for scripting. Assets from various 3D modeling programs can be imported. Facilities to publish to the PC, Mac, iPhone and Wii and support for real-time multiplayer games are available. Requires a final project.",
    "prerequisites": "None",
    "corequisites": "None",
    "rank": 45,
    "pickReason": "Based on the candidate's resume analysis:\n\n1. Skills Alignment (Score: Low)\n- The resume shows strong backend development skills (Python, Java, AWS) and web development experience\n- No prior experience with Unity, 3D graphics, or game development\n- While JavaScript knowledge is listed as intermediate, it's primarily used in web context, not game development\n\n2. Career Goals Alignment (Score: Low)\n- Resume indicates a clear focus on enterprise software engineering and cloud technologies\n- Work experience at LSEG, Allstate, and Citrix shows orientation towards business applications\n- No indication of interest or career direction in gaming or virtual environments\n\n3. Learning Gaps (Score: Moderate)\n- Could provide exposure to new programming paradigms\n- C# knowledge could be valuable for .NET development\n- 3D visualization skills might be tangentially useful for some enterprise applications\n\n4. Industry/Domain Relevance (Score: Low)\n- Current experience focuses on financial tech, insurance, and enterprise software\n- Projects show focus on chatbots, API integration, and data privacy\n- Virtual environments and game development are not aligned with current industry focus\n\nOverall Score: 45/100 - This is a weak match because:\n- While the course could provide some transferable programming skills (C#)\n- The core focus on 3D graphics and game development doesn't align with the candidate's enterprise software engineering trajectory\n- The time investment might be better spent on courses more aligned with their current career path in enterprise software development and cloud technologies",
    "hasPreReq": false,
    "hasCoreReq": false
  },
  {
    "_id": { "$oid": "6737e71853f6ff0e79aa3b00" },
    "name": "CSYE",
    "number": "7280",
    "subjectName": "User Experience Design and Testing",
    "credits": "4",
    "description": "Introduces user experience concepts while working on Web design projects. Offers students an opportunity to build the necessary skill sets to make better decisions when designing contemporary websites that cater to customer needs. Students practice interview techniques to understand user requirements while keeping user experience central to the effort. Uses wireframes and user scenarios to drive the creative design process. Various case studies are introduced and discussed in team settings to emphasize user perspectives. Uses quality assurance and usability testing to drive validation and user-acceptance testing and approvals.",
    "prerequisites": "CSYE 6200 (may be taken concurrently) with a minimum grade of B-  or  INFO 5100 (may be taken concurrently) with a minimum grade of B-  or  INFO 5100 (may be taken concurrently) with a minimum grade of B-",
    "corequisites": "None",
    "rank": 75,
    "pickReason": "After analyzing the resume against CSYE 7280 - User Experience Design and Testing, here's the detailed evaluation:\n\nStrengths (Why it's relevant):\n1. The candidate has strong web development experience using ReactJS, NextJS, and other frontend technologies, which aligns well with the web design focus of the course.\n2. Their project experience, particularly with the NEU course recommendation chatbot and What's You app, shows involvement in user-facing applications where UX principles are crucial.\n3. Their experience at Allstate collaborating with design teams for mobile features indicates prior exposure to UX concepts.\n4. The course would complement their technical skills with essential UX knowledge, making them a more well-rounded developer.\n\nSkills Alignment (22/30):\n- Strong technical foundation in web technologies\n- Previous exposure to UI/frontend development\n- Course would add formal UX methodology to existing technical skills\n\nCareer Goals Alignment (23/30):\n- Would enhance their capability to build user-centered applications\n- Valuable for full-stack development roles\n- Complements their software engineering background\n\nLearning Gaps (15/20):\n- Addresses the UX/UI design methodology gap in their skill set\n- Provides formal training in user research and testing\n\nIndustry/Domain Relevance (15/20):\n- Highly relevant for software engineering roles\n- Essential for web application development\n\nTotal Score: 75/100 (Strong Match)\n\nWhile the course is highly relevant to their technical background and would add significant value, it's not rated higher because the candidate's primary focus appears to be on backend/full-stack development rather than pure UX/UI design.",
    "hasPreReq": true,
    "hasCoreReq": false
  },
  {
    "_id": { "$oid": "6737e71853f6ff0e79aa3b01" },
    "name": "CSYE",
    "number": "7370",
    "subjectName": "Deep Learning and Reinforcement Learning in Game Engineering",
    "credits": "4",
    "description": "Introduces a deep learning and reinforcement learning framework for games called ML-Agents, which enable games and simulations to serve as environments for training intelligent agents. Studies and reviews classical game artificial intelligence (game AI), primarily search and decision trees. Uses game AI to generate responsive, adaptive, or intelligent behaviors primarily in nonplayer characters (NPCs) similar to human-like intelligence. Game AI includes everything from simple chasing and evading to pattern movement, to create opponents with complex tactical and strategic decisions.",
    "prerequisites": "INFO 5100 with a minimum grade of B  or  INFO 5100 with a minimum grade of B  or  CSYE 6200 with a minimum grade of B",
    "corequisites": "None",
    "rank": 85,
    "pickReason": "The course CSYE 7370 - Deep Learning and Reinforcement Learning in Game Engineering shows strong relevance to the candidate's profile for several key reasons:\n\n1. Skills Alignment (30/30):\n- The candidate is proficient in Python, which is commonly used in ML/AI implementations\n- Their projects demonstrate experience with GPT and AI models (NEU course recommendation RAG chatbot, Sensibo AI)\n- They have strong programming fundamentals needed for game engineering and AI implementation\n\n2. Career Goals Alignment (25/30):\n- The candidate's recent projects show a clear interest in AI/ML applications\n- Their work on intelligent systems (Sensibo AI) and recommendation systems indicates alignment with AI/ML career trajectory\n- The course would enhance their AI capabilities beyond just using existing models\n\n3. Learning Gaps (15/20):\n- While the candidate has experience with AI APIs and models, this course would provide deeper theoretical understanding\n- The game engineering aspect would add a new dimension to their AI expertise\n- Understanding ML-Agents framework would complement their existing cloud and infrastructure knowledge\n\n4. Industry/Domain Relevance (15/20):\n- Their current work involves building intelligent systems and optimization\n- Experience with performance optimization at LSEG and Citrix would benefit from understanding AI/ML implementations\n- The course's focus on responsive, adaptive behaviors aligns with their system architecture experience\n\nTotal Score: 85/100 - This represents a strong match due to the candidate's demonstrated interest in AI/ML, strong programming background, and relevant project experience, though there's room for growth in theoretical ML foundations and game-specific implementations.",
    "hasPreReq": true,
    "hasCoreReq": false
  },
  {
    "_id": { "$oid": "6737e71953f6ff0e79aa3b02" },
    "name": "CSYE",
    "number": "7380",
    "subjectName": "Theory and Practical Applications of AI Generative Modeling",
    "credits": "4",
    "description": "Covers transformer-based language models (e.g., ChatGPT and Bard); generative image models (e.g., GAN and variational autoencoder); and generative models for structured data (e.g., Bayesian networks). Explores generative models for data of major modalities, namely, textual, image, and structured relational. Offers students an opportunity to learn how to build such models for practical applications in different verticals using Python and numerous publicly available libraries in Keras/TensorFlow and PyTorch. Given recent surges in generative modeling tools, generative modeling technologies and applications are necessary skills for students entering the field of industrial data science.",
    "prerequisites": "INFO 6205 with a minimum grade of B",
    "corequisites": "None",
    "rank": 90,
    "pickReason": "The course CSYE 7380 shows exceptionally high relevance to the candidate's profile for several key reasons:\n\n1. Skills Alignment (30/30):\n- The candidate has demonstrated proficiency in Python, which is the primary programming language used in this course\n- Experience with GPT technologies is already listed in their skills\n- Projects like 'NEU course recommendation RAG chatbot' and 'Sensibo GPT' show practical experience with AI/ML technologies\n\n2. Career Goals Alignment (28/30):\n- The resume shows a clear trajectory toward advanced software engineering and AI applications\n- Recent projects heavily utilize GPT and AI technologies, indicating strong interest in this domain\n- The course perfectly complements their existing expertise in building AI-powered applications\n\n3. Learning Gaps (17/20):\n- While the candidate has experience with GPT applications, this course would provide deeper theoretical understanding\n- The course covers advanced topics like GANs and transformer models that would enhance their existing practical knowledge\n- Knowledge of various generative models would strengthen their ability to build more sophisticated AI applications\n\n4. Industry/Domain Relevance (17/20):\n- Their current work involves building intelligent systems and chatbots\n- The course content directly applies to their recent project work\n- The skills taught are highly relevant to their software engineering career path\n\nTotal Score: 90/100\n\nThis course would be an excellent choice for the candidate as it builds upon their existing experience while providing crucial theoretical foundations and practical applications in AI generative modeling, directly supporting their demonstrated interest in AI applications and software engineering systems.",
    "hasPreReq": true,
    "hasCoreReq": false
  },
  {
    "_id": { "$oid": "6737e71953f6ff0e79aa3b03" },
    "name": "CSYE",
    "number": "7470",
    "subjectName": "Advanced Game Analytics",
    "credits": "4",
    "description": "Explores the use of deep learning for the automated creation and analysis of game metrics. Uses convolutional neural networks (CNNs) to segment and identify anything on a game screen in real-time, which is used as input to AI systems. The second part of the course analyzes the importance of the metrics. Covers surrogate models, Shannon entropy, Individual Conditional Expectation (ICE), leave-one-covariate-out (LOCO), local feature importance, partial dependency plots, tree-based feature importance, standardized coefficient importance, accumulated local effects (ALE) plots, and Shapley values. Lastly, covers building predictive models with game data using the following techniques: supervised learning, generative/discriminative learning, parametric/nonparametric learning, neural networks, unsupervised learning reinforcement learning, and adaptive control.",
    "prerequisites": "INFO 6105 with a minimum grade of B",
    "corequisites": "None",
    "rank": 65,
    "pickReason": "Based on the resume analysis, this course receives a moderate to strong relevance score of 65/100. Here's the detailed breakdown:\n\nSkills Alignment (22/30):\n- The course's focus on deep learning and neural networks aligns with the candidate's Python proficiency and experience with AI/ML (GPT usage).\n- The candidate has worked on AI-related projects (NEU course recommendation RAG chatbot, Sensibo AI) showing interest in AI applications.\n\nCareer Goals Alignment (18/30):\n- While the candidate has software engineering experience, their recent projects show a pivot towards AI applications.\n- Game analytics is a specific niche that isn't directly evident in their career trajectory, though the underlying AI concepts are valuable.\n\nLearning Gaps (15/20):\n- The course would fill important gaps in deep learning and advanced analytics.\n- The predictive modeling component would enhance their existing ML knowledge.\n\nIndustry/Domain Relevance (10/20):\n- The gaming industry focus is not directly aligned with their current experience in fintech, insurance, and enterprise software.\n- However, the analytical and ML concepts are transferable to their domain.\n\nStrengths:\n- Aligns with their Python expertise\n- Builds on their AI/ML interest shown in projects\n- Covers advanced analytics valuable across domains\n\nLimitations:\n- Gaming industry focus is tangential to their current career path\n- Some concepts might be too specialized for their current trajectory\n\nThe course would provide valuable AI/ML knowledge but the gaming focus makes it less directly applicable to their current career path.",
    "hasPreReq": true,
    "hasCoreReq": false
  },
  {
    "_id": { "$oid": "6737e71a53f6ff0e79aa3b04" },
    "name": "CSYE",
    "number": "7550",
    "subjectName": "Distributed Intelligent Agents in the Metaverse",
    "credits": "4",
    "description": "Introduces the field of agent-based computing as enablers of metaverse social avatar systems. Focuses on important aspects that shape the agent’s experience within the challenging virtual-reality design and engineering landscape. Covers personal space, personified locomotion, agent aesthetics, agent social interactions, and agent’s relation to blockchain decentralized virtual identity. Students engage in projects to deliver VR platforms applicable to engineering fields such as mechanical, civil, chemical, and bioengineering. Considers distributed learning applications and certification of credentials, as well. Offers students an opportunity to learn how to configure various agent types to construct virtual worlds bursting with lively agent interactive experiences that go far beyond the constraints of the physical reality.",
    "prerequisites": "CSYE 7270 with a minimum grade of B ;  INFO 6205 with a minimum grade of B",
    "corequisites": "None",
    "rank": 45,
    "pickReason": "Based on the resume analysis, this course has weak to moderate relevance for the following reasons:\n\n1. Skills Alignment (Score: 10/30):\n- While the student has experience with various programming languages and cloud technologies, the course's focus on metaverse and VR platforms represents a significant departure from their current technical stack.\n- The resume shows no prior experience with VR, agent-based computing, or metaverse technologies.\n\n2. Career Goals Alignment (Score: 15/30):\n- The resume indicates a strong focus on enterprise software engineering, cloud computing, and web development.\n- Current work experience (LSEG, Allstate, Citrix) suggests a career path in traditional software engineering rather than metaverse/VR development.\n\n3. Learning Gaps (Score: 12/20):\n- While this course could provide exposure to emerging technologies, it doesn't directly address gaps in the student's current enterprise software engineering trajectory.\n- The blockchain and decentralized identity components might have some relevance to modern software architecture.\n\n4. Industry/Domain Relevance (Score: 8/20):\n- The student's experience is primarily in financial services, insurance, and enterprise software.\n- The course's focus on VR and metaverse represents a significant shift from these domains.\n\nWhile the course could provide interesting exposure to emerging technologies, it doesn't strongly align with the student's demonstrated career path and existing skill set. The prerequisites (CSYE 7270 and INFO 6205) suggest the student has the foundational knowledge, but the course content appears to be tangential to their current professional trajectory in enterprise software engineering.",
    "hasPreReq": true,
    "hasCoreReq": false
  },
  {
    "_id": { "$oid": "6737e72353f6ff0e79aa3b13" },
    "name": "DAMG",
    "number": "6105",
    "subjectName": "Data Science Engineering with Python",
    "credits": "4",
    "description": "Studies the Python programming language with data science as the application domain. Offers students an opportunity to learn how to perform complex numerical calculations, fixed data types, space efficiency, and vector manipulations. Covers tools and techniques for manipulating tables, spreadsheets, and group and pivot tables involving extremely large data sets. Covers large multidimensional arrays and matrices and the high-level mathematical functions to operate on these arrays. Studies how to use Python to manipulate the classic math and science algorithms. Analyzes helper functions such as linear and nonlinear regression, integration, Fourier transformations, numerical optimization, etc. Includes higher-level classes for manipulating and visualizing data. Applies tools and techniques to classical data science using cases such as time series forecasting, social network analysis, text analytics, and big data processing.",
    "prerequisites": "None",
    "corequisites": "None",
    "rank": 85,
    "pickReason": "This course shows strong relevance to the candidate's profile for several key reasons:\n\n1. Skills Alignment (30/30):\n- The candidate is already proficient in Python, making this an excellent opportunity to deepen expertise\n- Course perfectly aligns with their existing technical skillset\n- The data manipulation and visualization aspects complement their current programming knowledge\n\n2. Career Goals Alignment (25/30):\n- Given their experience with ML/AI projects (NEU course recommendation RAG chatbot)\n- Their work involves data processing and optimization (LSEG experience)\n- The course's focus on large data sets and mathematical algorithms aligns with their career trajectory\n\n3. Learning Gaps (15/20):\n- While proficient in Python, the specific focus on data science engineering would fill knowledge gaps\n- Advanced mathematical functions and algorithms would enhance their existing skill set\n- Time series forecasting and big data processing would add valuable new capabilities\n\n4. Industry/Domain Relevance (15/20):\n- Their project experience shows work with AI/ML (Sensibo AI, RAG chatbot)\n- Their professional experience involves data processing and optimization\n- The course's focus on large datasets aligns with their current work\n\nTotal Score: 85/100\n\nThis course would be highly beneficial as it directly builds upon their existing Python expertise while introducing specialized data science applications that align with their current project work and career direction in AI/ML and data processing.",
    "hasPreReq": false,
    "hasCoreReq": false
  },
  {
    "_id": { "$oid": "6737e72353f6ff0e79aa3b14" },
    "name": "DAMG",
    "number": "6210",
    "subjectName": "Data Management and Database Design",
    "credits": "4",
    "description": "Studies design of information systems from a data perspective for engineering and business applications; data modeling, including entity-relationship (E-R) and object approaches; user-centric information requirements and data sharing; fundamental concepts of database management systems (DBMS) and their applications; alternative data models, with emphasis on relational design; SQL; data normalization; data-driven application design for personal computer, server-based, enterprise-wide, and Internet databases; and distributed data applications.",
    "prerequisites": "None",
    "corequisites": "None",
    "rank": 85,
    "pickReason": "The course DAMG 6210 - Data Management and Database Design shows strong alignment with the candidate's profile based on several key factors:\n\nSkills Alignment (30/30):\n- The candidate has extensive experience with multiple databases (MySQL, PostgreSQL, MongoDB)\n- Their projects and work experience demonstrate practical database implementation\n- The course's focus on SQL and database design directly complements their existing skills\n\nCareer Goals Alignment (25/30):\n- The candidate's work at LSEG involved database optimization and data purging\n- Their projects (NEU course recommendation system, What's You) involved database design and management\n- The course would enhance their ability to design and optimize database systems\n\nLearning Gaps (15/20):\n- While the candidate has practical database experience, formal training in database design principles and E-R modeling would strengthen their theoretical foundation\n- The course's coverage of distributed data applications aligns with their cloud/DevOps experience\n\nIndustry/Domain Relevance (15/20):\n- Database design is crucial in software engineering and enterprise applications\n- The course's focus on business applications aligns with their experience in fintech (LSEG) and insurance (Allstate)\n\nTotal Score: 85/100\n\nThis course would be highly beneficial as it provides formal theoretical foundations to complement their practical database experience, particularly valuable for their software engineering career path.",
    "hasPreReq": false,
    "hasCoreReq": false
  },
  {
    "_id": { "$oid": "6737e72453f6ff0e79aa3b15" },
    "name": "DAMG",
    "number": "7105",
    "subjectName": "Intelligent Data Modeling and Presentation for Engineers",
    "credits": "4",
    "description": "Studies every step in a data analysis pipeline and the visual techniques that aid in understanding the quality of each step. Offers students an opportunity to visualize the quality of their data, learn how to fix issues, and then visualize what those fixes helped. Focuses on visualizing models to produce actionable insights and how to visualize causal relationships in models. Emphasizes attention to graphical machine-learning models and how to visualize the critical parts of a network. Covers graphic design principles to assist students to effectively communicate their findings.",
    "prerequisites": "INFO 5002 with a minimum grade of B  or  INFO 6105 with a minimum grade of B  or  DAMG 6105 with a minimum grade of B",
    "corequisites": "None",
    "rank": 85,
    "pickReason": "The course DAMG 7105 - Intelligent Data Modeling and Presentation for Engineers shows strong relevance to the candidate's profile for several key reasons:\n\nSkills Alignment (30/30):\n- The candidate's proficiency in Python and experience with data-centric projects (like the NEU course recommendation RAG chatbot) aligns perfectly with the course's focus on data analysis pipelines\n- Their experience with visualization and machine learning (demonstrated in projects) makes them well-prepared for the course's emphasis on model visualization and causal relationships\n\nCareer Goals Alignment (25/30):\n- Given their work at LSEG involving data optimization and their project involving recommendation systems, this course would enhance their ability to present and model data effectively\n- The visualization skills taught would be valuable for their software engineering career, especially in data-driven applications\n\nLearning Gaps (15/20):\n- While they have strong programming skills, the course would fill gaps in advanced data visualization and machine learning model interpretation\n- The graphic design principles covered would complement their technical skills with important presentation capabilities\n\nIndustry/Domain Relevance (15/20):\n- The course directly relates to their work in software engineering and data-driven applications\n- The focus on actionable insights aligns with their experience in optimization and performance enhancement\n\nTotal Score: 85/100 - This is a highly relevant course that would enhance their existing skillset while providing new tools for data visualization and model interpretation, directly applicable to their current career trajectory in software engineering and data-driven applications.",
    "hasPreReq": true,
    "hasCoreReq": false
  },
  {
    "_id": { "$oid": "6737e72553f6ff0e79aa3b16" },
    "name": "DAMG",
    "number": "7245",
    "subjectName": "Big-Data Systems and Intelligence Analytics",
    "credits": "4",
    "description": "Offers students an opportunity to learn a hands-on approach to understanding how large-scale data sets are processed and how data science algorithms are adopted in the industry through case studies and labs. This project-based course builds on INFO 7390 and focuses on enabling students with tools and frameworks primarily to build end-to-end applications. The course is divided into three parts: building the data pipeline for data science, implementing data science algorithms, and scaling and deploying data science algorithms.",
    "prerequisites": "DAMG 6105 with a minimum grade of B  or  INFO 6105 with a minimum grade of B",
    "corequisites": "None",
    "rank": 85,
    "pickReason": "The course 'DAMG 7245 - Big-Data Systems and Intelligence Analytics' demonstrates a strong alignment with the candidate's profile for several key reasons:\n\nSkills Alignment (30/30):\n- The candidate's proficiency in Python, AWS, and database systems (MySQL, PostgreSQL, MongoDB) directly aligns with the big data processing requirements of the course\n- Experience with cloud services (AWS, GCP) matches the course's focus on large-scale data processing\n- The development background in various frameworks indicates readiness for end-to-end application development\n\nCareer Goals Alignment (25/30):\n- Given the candidate's software engineering background and project experience (especially the NEU course recommendation RAG chatbot), this course would enhance their data engineering capabilities\n- The course's focus on industry case studies aligns with their professional experience at companies like LSEG where they worked on large-scale data systems\n\nLearning Gaps (15/20):\n- While the candidate has experience with databases and cloud systems, the course would provide formal training in big data processing and intelligence analytics\n- The course would bridge gaps in specialized data science algorithm implementation and deployment\n\nIndustry/Domain Relevance (15/20):\n- The course's emphasis on building data pipelines and scaling algorithms directly relates to their work at LSEG where they optimized database systems\n- Their project experience with AI/ML (GPT models, recommendation systems) shows clear interest in the field\n\nTotal Score: 85/100 - This represents a strong match due to:\n1. Direct alignment with technical skills\n2. Relevance to current project work\n3. Clear progression path for their career in software engineering with data science focus\n4. Practical application potential in their current and future roles",
    "hasPreReq": true,
    "hasCoreReq": false
  },
  {
    "_id": { "$oid": "6737e72553f6ff0e79aa3b17" },
    "name": "DAMG",
    "number": "7250",
    "subjectName": "Big Data Architecture and Governance",
    "credits": "4",
    "description": "Focuses on creating and managing a data-driven enterprise. Geared to current IT technical professionals, data scientists, technical project managers, aspiring IT professionals, and managers who want to understand the complex nature of creating and managing data-driven projects to support the new and legacy data environments. Covers the analysis that is required to design data-driven projects and make appropriate recommendations for the target state of an organization. This analysis is used as input to create a comprehensive road map to achieve the target state and includes current and future uses of data, consumption methods, data sources and categories, and aggregation and quality requirements.",
    "prerequisites": "CSYE 6200 with a minimum grade of B  or  DAMG 6105 with a minimum grade of B  or  DAMG 6210 with a minimum grade of B  or  INFO 5100 with a minimum grade of B  or  INFO 6210 with a minimum grade of B",
    "corequisites": "None",
    "rank": 85,
    "pickReason": "The course 'DAMG 7250 - Big Data Architecture and Governance' shows strong relevance to the candidate's profile for the following reasons:\n\n1. Skills Alignment (30/30):\n- The candidate's experience with AWS, GCP, and database systems (MySQL, PostgreSQL, MongoDB) directly aligns with big data architecture concepts.\n- Their proficiency in Python and Java, combined with cloud services experience, provides a solid foundation for big data implementations.\n\n2. Career Goals Alignment (25/30):\n- The candidate's work at London Stock Exchange Group involved database optimization and large-scale data processing, indicating a career trajectory where big data knowledge is valuable.\n- Their project experience, especially with the NEU course recommendation RAG chatbot, shows interest in data-driven applications.\n\n3. Learning Gaps (15/20):\n- While the candidate has experience with databases and cloud services, formal knowledge of enterprise-level data governance would fill a crucial knowledge gap.\n- The course would provide strategic insight into data-driven project management, complementing their technical skills.\n\n4. Industry/Domain Relevance (15/20):\n- The candidate's experience in financial services (LSEG) and insurance (Allstate) industries, where data governance is crucial, makes this course highly relevant.\n- Their projects demonstrate involvement with data-intensive applications, making enterprise data architecture knowledge valuable.\n\nTotal Score: 85/100 - This is a strong match as it builds upon the candidate's existing technical foundation while providing crucial enterprise-level knowledge in data architecture and governance, which would be valuable for senior technical roles.",
    "hasPreReq": true,
    "hasCoreReq": false
  },
  {
    "_id": { "$oid": "6737e72753f6ff0e79aa3b18" },
    "name": "DAMG",
    "number": "7275",
    "subjectName": "Advanced Database Management Systems",
    "credits": "4",
    "description": "Introduces the skill set required to become a serious database applications developer. Offers an overview of the Oracle9i object-relational database system for those who have mastered the fundamental principles of database design and are competent with basic SQL. Gives students the opportunity to develop a strong understanding of the PL/SQL programming language, which is used to create triggers, user-generated functions, stored procedures, and packages for programming Oracle objects. Emphasizes advanced SQL features and Oracle-specific SQL enhancements. Covers optimization and tuning issues. Covers corresponding material for Transact-SQL (used for Microsoft SQL Server and Sybase database systems) as time and resources permit.",
    "prerequisites": "DAMG 6210 with a minimum grade of B  or  INFO 6210 with a minimum grade of B",
    "corequisites": "None",
    "rank": 85,
    "pickReason": "The DAMG 7275 - Advanced Database Management Systems course receives a high relevance score of 85 based on several key factors aligned with the candidate's profile:\n\n1. Skills Alignment (30/30):\n- The candidate has direct experience with multiple databases (MySQL, PostgreSQL, MongoDB)\n- Their work at LSEG involved database optimization using Micronaut/AWS architecture\n- They have demonstrated experience with data processing and optimization\n\n2. Career Goals Alignment (25/30):\n- The course's focus on advanced database concepts aligns well with their enterprise-level software engineering experience\n- Their role at LSEG involved significant database optimization work\n- The course's coverage of PL/SQL and advanced database concepts would enhance their current skill set\n\n3. Learning Gaps (15/20):\n- While the candidate has database experience, the course offers advanced concepts like PL/SQL and optimization techniques that would fill knowledge gaps\n- The course's focus on Oracle-specific features would add valuable enterprise database expertise\n\n4. Industry/Domain Relevance (15/20):\n- The candidate's work in financial services (LSEG) and insurance (Allstate) sectors heavily relies on database systems\n- Their experience with cloud services and data processing makes advanced database knowledge highly relevant\n\nTotal Score Breakdown:\n- Strong match with existing skills: +30\n- Direct career advancement potential: +25\n- Addresses learning gaps: +15\n- Industry relevance: +15\n\nThe course would significantly enhance their database expertise and complement their existing technical stack, particularly valuable for their enterprise software engineering career path.",
    "hasPreReq": true,
    "hasCoreReq": false
  },
  {
    "_id": { "$oid": "6737e72753f6ff0e79aa3b19" },
    "name": "DAMG",
    "number": "7290",
    "subjectName": "Data Warehousing and Business Intelligence",
    "credits": "4",
    "description": "Examines the technical and management aspects of building a data warehouse. Explores the architecture, infrastructure, processes, data quality, database design, and data analysis involved in building the data warehouse for business analysis. Management issues include business goals, tool selection, project management, personnel skills, training, and user requirements. Topics include dimensional data modeling, extraction/transformation/load processes, data quality problems, datamarts, operational data stores (ODS), staging databases, and online analytic processing (OLAP).",
    "prerequisites": "DAMG 6210 with a minimum grade of B  or  DAMG 7275 with a minimum grade of B  or  INFO 6205 with a minimum grade of B  or  INFO 6210 with a minimum grade of B",
    "corequisites": "None",
    "rank": 85,
    "pickReason": "The DAMG 7290 - Data Warehousing and Business Intelligence course shows a strong alignment with the candidate's profile for several key reasons:\n\nSkills Alignment (30/30):\n- The candidate has strong experience with various databases (MySQL, PostgreSQL, MongoDB) which directly aligns with the course's focus on data warehouse design and implementation.\n- Their professional experience includes optimizing database systems and handling large-scale data processing (as seen in LSEG experience).\n- They've worked with cloud services (AWS) which complements the data warehouse infrastructure aspects.\n\nCareer Goals Alignment (25/30):\n- The candidate's project experience (NEU course recommendation RAG chatbot) shows interest in data-driven applications.\n- Their professional trajectory indicates movement towards large-scale data systems and business intelligence solutions.\n- The course would enhance their ability to design and implement enterprise-level data solutions.\n\nLearning Gaps (15/20):\n- While the candidate has database experience, specialized knowledge in data warehousing, dimensional modeling, and OLAP would fill important knowledge gaps.\n- The course would provide formal training in ETL processes, which would complement their existing data processing experience.\n\nIndustry/Domain Relevance (15/20):\n- The candidate's experience in financial services (LSEG) and insurance (Allstate) industries aligns well with business intelligence applications.\n- Their work with large-scale data systems suggests immediate applicability of course concepts.\n\nTotal Score: 85/100 - This represents a strong match given the candidate's technical background and career trajectory in data-intensive applications and systems.",
    "hasPreReq": true,
    "hasCoreReq": false
  },
  {
    "_id": { "$oid": "6737e72853f6ff0e79aa3b1a" },
    "name": "DAMG",
    "number": "7325",
    "subjectName": "Introduction to Information Technology Auditing",
    "credits": "4",
    "description": "Designed to provide a foundation for the study and professional career development of information technology (IT) auditing. Introduces the fundamentals of IT auditing, core reasons why this is a specialized area of auditing, and the principle objectives of IT auditing and its relationship to integrated financial or operational auditing. Offers an insight into management‘s objectives regarding IT risk management. Uses the Cobit governance and control framework to emphasize management issues regarding control of IT and the achievement of value through managed IT processes. Introduces three primary types of IT audits: the audits of computerized information systems, IT processing environments, and the process of developing and implementing information systems.",
    "prerequisites": "DAMG 6105 with a minimum grade of B ;  (DAMG 6210 with a minimum grade of B  or  INFO 6210 with a minimum grade of B )",
    "corequisites": "None",
    "rank": 65,
    "pickReason": "The DAMG 7325 (Introduction to IT Auditing) course shows moderate relevance to the candidate's profile based on the following analysis:\n\nStrengths (Supporting Higher Score):\n1. The candidate has extensive experience with cloud services (AWS, GCP) and security implementations, including experience with Web Application Firewall (WAF) and zero-trust IAM authentication at LSEG.\n2. Their work at LSEG involved security vulnerabilities and incident prevention, which aligns with IT auditing principles.\n3. The course's focus on IT risk management and control frameworks could complement their existing technical knowledge.\n\nLimitations (Supporting Lower Score):\n1. The candidate's primary focus is software development and engineering, not IT auditing or compliance.\n2. The resume shows stronger alignment with hands-on development rather than governance and auditing roles.\n3. While security is part of their experience, it's not their primary focus based on the project portfolio.\n\nBreakdown of Score Components:\n- Skills Alignment (20/30): Some overlap with security implementation experience but not direct auditing skills\n- Career Goals Alignment (15/30): Limited evidence of career direction toward IT auditing\n- Learning Gaps (15/20): Could provide valuable governance knowledge\n- Industry/Domain Relevance (15/20): Relevant to enterprise software development context\n\nWhile the course could provide valuable complementary knowledge, especially regarding IT governance and risk management, it's not perfectly aligned with the candidate's current career trajectory in software engineering.",
    "hasPreReq": true,
    "hasCoreReq": false
  },
  {
    "_id": { "$oid": "6737e72853f6ff0e79aa3b1b" },
    "name": "DAMG",
    "number": "7350",
    "subjectName": "Systems and Cybersecurity Fundamentals",
    "credits": "4",
    "description": "Presents the principles of data and technology that define systems and cybersecurity from a socio-technical perspective. Offers students an opportunity to gain insight into the importance of systems security within cybersecurity and the integral role that information systems analysts play in developing cybersecure systems that people use. Through hands-on dynamic learning, students explore foundational cybersecurity principles, security architecture, risk management, attacks and mitigation strategies using Kali Linux, cyber incident response, and emerging IT/IS technologies.",
    "prerequisites": "DAMG 6105 with a minimum grade of B ;  (DAMG 6210 with a minimum grade of B  or  INFO 6210 with a minimum grade of B )",
    "corequisites": "None",
    "rank": 85,
    "pickReason": "The course DAMG 7350 (Systems and Cybersecurity Fundamentals) shows strong relevance to the candidate's profile for several compelling reasons:\n\n1. Skills Alignment (30/30):\n- The candidate has extensive experience with cloud services (AWS, GCP) and DevOps tools\n- Their work at LSEG involved implementing Web Application Firewall (WAF) and zero-trust IAM authentication\n- They have demonstrated experience with security vulnerabilities (Log4Shell, XSS)\n- Their proficiency in Linux aligns with the course's use of Kali Linux\n\n2. Career Goals Alignment (25/30):\n- The candidate's experience at LSEG shows a clear trajectory toward security-focused software engineering\n- The course would strengthen their existing security implementation experience\n- The socio-technical perspective would complement their technical expertise\n\n3. Learning Gaps (15/20):\n- While the candidate has practical security implementation experience, the course would provide formal theoretical foundations\n- The systematic approach to security architecture and risk management would fill knowledge gaps\n\n4. Industry/Domain Relevance (15/20):\n- The financial sector experience (LSEG) directly benefits from strong cybersecurity knowledge\n- Their project 'What's You' focused on data privacy, showing interest in security domains\n\nTotal Score: 85/100\n\nThe course would significantly enhance their existing practical experience with formal cybersecurity principles and frameworks, making it highly relevant to their career trajectory.",
    "hasPreReq": true,
    "hasCoreReq": false
  },
  {
    "_id": { "$oid": "6737e72953f6ff0e79aa3b1c" },
    "name": "DAMG",
    "number": "7370",
    "subjectName": "Designing Advanced Data Architectures for Business Intelligence",
    "credits": "4",
    "description": "Focuses on designing advanced data architectures supporting structured, unstructured, and semistructured data sources; hybrid integration and data engineering; and analytical uses by casual information consumers, power users, and data scientists. Technologies include databases (relational, columnar, in-memory, and NoSQL); hybrid data, application, and cloud integration; data preparation; data virtualization; descriptive, diagnostic, predictive, and prescriptive analytics; and on-premise and on-cloud deployments. Topics include data structures, data models, data integration workflow and data engineering, data integration, data preparation, and data virtualization.",
    "prerequisites": "DAMG 6210 with a minimum grade of B  or  INFO 6210 with a minimum grade of B",
    "corequisites": "None",
    "rank": 85,
    "pickReason": "The course 'DAMG 7370 - Designing Advanced Data Architectures for Business Intelligence' shows strong alignment with the candidate's background and current trajectory for several key reasons:\n\nStrong Points (Contributing to high score):\n1. The resume shows extensive experience with databases (MySQL, PostgreSQL, MongoDB) which directly aligns with the course's focus on advanced data architectures.\n2. The candidate has implemented database optimizations at LSEG, achieving '90% faster data purging and enabling parallel processing of 1000+ records,' showing practical experience in data engineering.\n3. The NEU course recommendation RAG chatbot project demonstrates experience with NoSQL databases and data architecture, which the course directly builds upon.\n4. The candidate's work with cloud technologies (AWS, GCP) aligns with the course's coverage of cloud integration and on-cloud deployments.\n\nModerate Alignment Points:\n1. Experience with data integration and workflow automation as evidenced in LSEG experience.\n2. Background in both structured (SQL) and unstructured (NoSQL) data management.\n3. The course's focus on business intelligence adds a valuable layer to the candidate's technical expertise.\n\nGaps This Course Addresses:\n1. Advanced data architecture concepts and business intelligence applications.\n2. Hybrid integration and comprehensive data engineering principles.\n3. Advanced analytics (descriptive, diagnostic, predictive, and prescriptive).\n\nThe ranking of 85/100 reflects the strong alignment between the candidate's technical background and the course content, while acknowledging that this course would significantly enhance their existing knowledge in data architecture and business intelligence applications.",
    "hasPreReq": true,
    "hasCoreReq": false
  },
  {
    "_id": { "$oid": "6737e72953f6ff0e79aa3b1d" },
    "name": "DAMG",
    "number": "7390",
    "subjectName": "Advances in Hybrid Data Integration and Engineering",
    "credits": "4",
    "description": "Offers students an opportunity to understand concepts on integration use cases, integration processes and personae, data governance (with privacy and security), and data management, in an era when enterprises are increasingly adding, expanding, and altering data sources. While gathering data is often straightforward, enterprises struggle to integrate, cleanse, curate, transform, and govern data to deliver comprehensive and consistent data to support operations and enable analytics. Covers real-world integration use cases that present data fragmentation, data inconsistency, and data quality challenges and effective architectures needed to design, develop, and implement hybrid integration platforms. Studies how to apply theory and best and pragmatic practices with various technologies to implement hybrid integration platform solutions.",
    "prerequisites": "DAMG 7370 with a minimum grade of B-",
    "corequisites": "None",
    "rank": 85,
    "pickReason": "Based on the resume analysis, DAMG 7390 (Advances in Hybrid Data Integration and Engineering) shows strong relevance for the following reasons:\n\n1. Skills Alignment (30/30):\n- The course's focus on data integration and engineering directly complements the candidate's extensive experience with various databases (MySQL, PostgreSQL, MongoDB)\n- The candidate's proficiency in cloud services (AWS, GCP) aligns perfectly with the course's coverage of hybrid integration platforms\n- Experience with data transformation and integration tools through projects like the NEU course recommendation RAG chatbot\n\n2. Career Goals Alignment (25/30):\n- The candidate's work at LSEG involved database optimization and data processing, indicating a career trajectory in data engineering\n- The course's emphasis on data governance and integration would enhance their current role in software engineering systems\n- Their project experience with NoSQL databases and API management shows interest in data integration\n\n3. Learning Gaps (15/20):\n- The course would fill knowledge gaps in data governance, privacy, and security\n- Would provide formal training in data integration architectures, complementing their practical experience\n\n4. Industry/Domain Relevance (15/20):\n- Highly relevant to their current work in financial services (LSEG) where data integration is crucial\n- Aligns with their experience in building scalable systems and handling large datasets\n\nTotal Score: 85/100 - This course would provide valuable theoretical foundations and best practices to complement their existing practical experience in data engineering and integration.",
    "hasPreReq": true,
    "hasCoreReq": false
  }
]
